index.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Hyprland and Hyprland-related configuration files
#+date: <2024-03-23 Sat>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.2 (Org mode 9.6.15)
#+cite_export:
#+property: EXPORT_FILE_NAME: index.html
#+startup: content indent
#+export_file_name: index.html
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>

This is my /hyprland/ configuration alongside with other configuration for various applications I use.
* Hyprland
** =~/.config/hypr/hypland.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hyprland.conf :mkdirp t
:END:
*** header :noexport:
#+begin_src conf
  # -*- eval: (rainbow-mode 1) -*-
#+end_src
Enable the =rainbow-mode= minor-mode for /Emacs/ in this file. 
*** Modular configuration files
#+begin_src conf
  source = ./hypr.d/monitors.conf
  source = ./hypr.d/variables.conf
  source = ./hypr.d/autostart.conf
  source = ./hypr.d/input.conf
  source = ./hypr.d/general.conf
  source = ./hypr.d/groups.conf
  source = ./hypr.d/decoration.conf
  source = ./hypr.d/animations.conf
  source = ./hypr.d/dwindle.conf
  source = ./hypr.d/master.conf
  source = ./hypr.d/gestures.conf
  source = ./hypr.d/binds.conf
  source = ./hypr.d/misc.conf
  source = ./hypr.d/devices.conf
  source = ./hypr.d/windowrule.conf
  source = ./hypr.d/workspaces.conf
  source = ./hypr.d/keybindings.conf
  source = ./hypr.d/xwayland.conf
#+end_src
I split the configuration file into sections, based on the section from the [[https://wiki.hyprland.org/Configuring/Variables/][configuration variables]].
** =~/.config/hypr/hypr.d/monitors.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/monitors.conf :mkdirp t
:END:

#+begin_src conf
  # See https://wiki.hyprland.org/Configuring/Monitors/
  monitor=,highrr,auto,1
  # monitor=,1920x1080@60,auto,1
  monitor=DP-1,preferred,auto,1
  monitor=DP-2,preferred,auto,1
  monitor=DP-3,preferred,auto,1
  monitor=DP-4,preferred,auto,1
  monitor=DP-5,preferred,auto,1

  # laptop
  monitor = HDMI-A-1, preferred, auto, 1

  # specific monitors
  # Samsung
  monitor = desc:Samsung Electric Company SMS19A100 HMAC900747, preferred, auto, 1
#+end_src
These are the monitors I used across all my machines.
