index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-08 Sun 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hyprland and Hyprland-related configuration files</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hyprland and Hyprland-related configuration files</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7aee855">Hyprland</a>
<ul>
<li><a href="#org5879cd5"><code>~/.config/hypr/hypland.conf</code></a>
<ul>
<li><a href="#orgec4ffce">Modular configuration files</a></li>
</ul>
</li>
<li><a href="#org3fefc5b"><code>~/.config/hypr/hypr.d/monitors.conf</code></a></li>
<li><a href="#orgd7fbc19"><code>~/.config/hypr/hypr.d/autostart.conf</code></a>
<ul>
<li><a href="#org3eb2a9e">Additional GTK Settings</a></li>
</ul>
</li>
<li><a href="#org2f54f34"><code>~/.config/hypr/hypr.d/variables.conf</code></a>
<ul>
<li><a href="#org92fc913">Applications</a></li>
<li><a href="#org5cd9616">Environment Variables</a></li>
<li><a href="#org8461449">Wallpapers</a></li>
</ul>
</li>
<li><a href="#org9027ac3"><code>~/.config/hypr/hypr.d/input.conf</code></a></li>
<li><a href="#orgc069b3f"><code>~/.config/hypr/hypr.d/general.conf</code></a></li>
<li><a href="#orgc6f0eee"><code>~/.config/hypr/hypr.d/decoration.conf</code></a></li>
<li><a href="#org72b17b5"><code>~/.config/hypr/hypr.d/animations.conf</code></a></li>
<li><a href="#orgfbff780"><code>~/.config/hypr/hypr.d/dwindle.conf</code></a></li>
<li><a href="#org97b19b0"><code>~/.config/hypr/hypr.d/master.conf</code></a></li>
<li><a href="#org0685b14"><code>~/.config/hypr/hypr.d/gestures.conf</code></a></li>
<li><a href="#orgc38a45d"><code>~/.config/hypr/hypr.d/groups.conf</code></a></li>
<li><a href="#org3949cc7"><code>~/.config/hypr/hypr.d/binds.conf</code></a></li>
<li><a href="#org1b98f55"><code>~/.config/hypr/hypr.d/misc.conf</code></a></li>
<li><a href="#orgac43d8f"><code>~/.config/hypr/hypr.d/devices.conf</code></a></li>
<li><a href="#orgcc511fa"><code>~/.config/hypr/hypr.d/windowrule.conf</code></a>
<ul>
<li><a href="#orgd434e76">For all windows</a></li>
<li><a href="#org2b28a6b"><code>pavucontrol</code></a></li>
<li><a href="#org6932ef5"><code>pwvucontrol</code></a></li>
<li><a href="#org968744c"><code>polkit-kde-agent</code></a></li>
<li><a href="#org4d26ee5"><code>blueman</code></a></li>
<li><a href="#org28b74fb"><code>thunderbird</code></a></li>
<li><a href="#orgdfb3868"><code>firefox</code></a></li>
<li><a href="#org4682f57"><code>Qtpass</code></a></li>
<li><a href="#orge934005"><code>zoom</code></a></li>
<li><a href="#orge16f3fb"><code>file-roller</code></a></li>
<li><a href="#org06b2b13"><code>ncmpcpp</code></a></li>
<li><a href="#orgcd7c7b6"><code>khal</code></a></li>
<li><a href="#orgae9a8ed"><code>astroid</code></a></li>
<li><a href="#org39347d4"><code>vlc</code></a></li>
<li><a href="#org22306da"><code>remmina</code></a></li>
<li><a href="#org5b6674c">libvirt / virt-manager</a></li>
<li><a href="#org0dd8ae9"><code>transmission</code></a></li>
<li><a href="#orgd6a4eb6">dialogs</a></li>
<li><a href="#org72460c8"><code>thunar</code></a></li>
<li><a href="#org8500c40">no tearing</a></li>
<li><a href="#orgdf17748"><code>htop</code></a></li>
<li><a href="#orgb3596cd"><code>nmtui</code></a></li>
<li><a href="#org0e842c9"><code>vim</code></a></li>
<li><a href="#org890e8b2"><code>Emacs</code> (in terminal mode)</a></li>
<li><a href="#org4a07587"><code>showmethekey</code></a></li>
<li><a href="#org4f90370"><code>screenkey</code></a></li>
<li><a href="#org76ff07a">steam</a></li>
<li><a href="#orgd3fad37">conky</a></li>
<li><a href="#org49ebc12">easyeffect</a></li>
<li><a href="#orga9a3640">layer</a></li>
</ul>
</li>
<li><a href="#orgd41c934"><code>~/.config/hypr/hypr.d/workspaces.conf</code></a>
<ul>
<li><a href="#org93e3e40">Normal Workspaces</a></li>
<li><a href="#orgb19d79c">Special workspaces</a></li>
</ul>
</li>
<li><a href="#org2fd0697"><code>~/.config/hypr/hypr.d/keybindings.conf</code></a>
<ul>
<li><a href="#orge2a10d5">Set the <code>mainMod</code> variable</a></li>
<li><a href="#org902d045">Apps keybindings</a></li>
<li><a href="#org721ae09">window</a></li>
<li><a href="#orgd24f863">Mouse</a></li>
<li><a href="#org9721925">Media keys</a></li>
<li><a href="#org0c5d779"><code>dunst</code></a></li>
<li><a href="#org74e7828">Groups</a></li>
<li><a href="#orgeef04ef">Hyprland</a></li>
<li><a href="#orgcf0bfb2">Workspaces</a></li>
</ul>
</li>
<li><a href="#org7ee026a"><code>~~/.config/hypr/hypr.d/xwayland.conf~</code></a></li>
</ul>
</li>
<li><a href="#org1a4c0ee">waybar</a>
<ul>
<li><a href="#orga06f33b"><code>~/.config/waybar/config</code></a>
<ul>
<li><a href="#orgfefdd4d">start config</a></li>
<li><a href="#orgde45809">General</a></li>
<li><a href="#org4161a19">Left Modules</a></li>
<li><a href="#org969fec6">Center Modules</a></li>
<li><a href="#org9a02249">Right Modules</a></li>
<li><a href="#org8352829">Modules Configuration</a></li>
<li><a href="#org538bea3">End config</a></li>
</ul>
</li>
<li><a href="#org486b662"><code>~/.config/waybar/style.css</code></a>
<ul>
<li><a href="#orge203e5a">definitions</a></li>
<li><a href="#org965097e">global</a></li>
<li><a href="#orge73b685">keyframes</a></li>
<li><a href="#orgd7be695">window</a></li>
<li><a href="#org98e0978">button</a></li>
<li><a href="#org6f5eae3">tooltip</a></li>
<li><a href="#orgf3d1895">modules</a></li>
<li><a href="#orgfdda4d4">workspaces</a></li>
<li><a href="#org7e9e89d">mode</a></li>
<li><a href="#org1d5f85b">submap</a></li>
<li><a href="#org6fb1108">tray</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org823d539">hyprpaper</a></li>
<li><a href="#org141947d">hyprshade</a></li>
<li><a href="#orgd149543">hyprlock</a></li>
<li><a href="#orge4282b1">hypridle</a></li>
<li><a href="#orgb33c183">Alacritty</a>
<ul>
<li><a href="#orgdc0e19f">~/.config/alacritty/alacritty.toml</a></li>
<li><a href="#org2fdd863">nord theme</a></li>
</ul>
</li>
<li><a href="#orga261c73">Swappy</a></li>
<li><a href="#org2cc6b46">Rofi configuration</a>
<ul>
<li><a href="#org481fa83">hyprland-menu</a></li>
<li><a href="#org38f2165">hyprland-logout</a></li>
<li><a href="#orgfff60eb">hyprland-clipboard</a></li>
<li><a href="#orgf6729fc">hyprland-emoji</a></li>
</ul>
</li>
<li><a href="#org2e45679">screen-record</a></li>
</ul>
</div>
</div>
<p>
This is my <i>hyprland</i> configuration alongside with other configuration for various applications I use.
</p>
<div id="outline-container-org7aee855" class="outline-2">
<h2 id="org7aee855">Hyprland</h2>
<div class="outline-text-2" id="text-org7aee855">
</div>
<div id="outline-container-org5879cd5" class="outline-3">
<h3 id="org5879cd5"><code>~/.config/hypr/hypland.conf</code></h3>
<div class="outline-text-3" id="text-org5879cd5">
</div>
<div id="outline-container-orgec4ffce" class="outline-4">
<h4 id="orgec4ffce">Modular configuration files</h4>
<div class="outline-text-4" id="text-orgec4ffce">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">source</span> = ./hypr.d/monitors.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/variables.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/autostart.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/input.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/general.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/groups.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/decoration.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/animations.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/dwindle.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/master.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/gestures.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/binds.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/misc.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/devices.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/windowrule.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/workspaces.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/keybindings.conf
<span style="color: #b8860b;">source</span> = ./hypr.d/xwayland.conf
</pre>
</div>
<p>
I split the configuration file into sections, based on the section from the <a href="https://wiki.hyprland.org/Configuring/Variables/">configuration variables</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org3fefc5b" class="outline-3">
<h3 id="org3fefc5b"><code>~/.config/hypr/hypr.d/monitors.conf</code></h3>
<div class="outline-text-3" id="text-org3fefc5b">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Monitors/</span>
<span style="color: #b8860b;">monitor</span>=,highrr,auto,1
<span style="color: #b22222;"># </span><span style="color: #b22222;">monitor=,1920x1080@60,auto,1</span>
<span style="color: #b8860b;">monitor</span>=DP-1,preferred,auto,1
<span style="color: #b8860b;">monitor</span>=DP-2,preferred,auto,1
<span style="color: #b8860b;">monitor</span>=DP-3,preferred,auto,1
<span style="color: #b8860b;">monitor</span>=DP-4,preferred,auto,1
<span style="color: #b8860b;">monitor</span>=DP-5,preferred,auto,1

<span style="color: #b22222;"># </span><span style="color: #b22222;">laptop</span>
<span style="color: #b8860b;">monitor</span> = HDMI-A-1, preferred, auto, 1

<span style="color: #b22222;"># </span><span style="color: #b22222;">specific monitors</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Samsung</span>
<span style="color: #b8860b;">monitor</span> = desc:Samsung Electric Company SMS19A100 HMAC900747, preferred, auto, 1
</pre>
</div>
<p>
These are the monitors I used across all my machines.
</p>
</div>
</div>
