index.org
** =~/.config/hypr/hypr.d/autostart.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/autostart.conf :mkdirp t
:END:

#+begin_src conf
  exec-once = systemctl --user import-environment WAYLAND_DISPLAY XDG_CURRENT_DESKTOP QT_QPA_PLATFORMTHEME SSH_AUTH_SOCK
  exec-once = dbus-update-activation-environment --systemd --all &
  exec-once = /usr/lib/polkit-kde-authentication-agent-1 &
  exec-once = gnome-keyring-daemon --components=pkcs11,secrets,ssh -r -d &
  exec-once = dbus-launch --sh-syntax --exit-with-session dunst -conf ~/.config/dunst/dunstrc &
  exec-once = pgrep hypridle || hypridle
  exec-once = waybar &
  exec-once = hyprpaper &
  exec-once = wl-paste --type text --watch cliphist store &
  exec-once = wl-paste --type image --watch cliphist store &
  exec-once = hyprctl setcursor Bibata-Modern-Classic 24
  exec-once = hyprpm reload
  exec-once = hyprshade auto &
  # exec-once = thunar --daemon &
  exec-once = hypridle
  exec-once = emacs --daemon &
  exec-once = blueman-applet &
  exec-once = blueman-tray &
  exec-once = nm-applet --indicator
  exec-once = /usr/bin/kdeconnectd
  exec-once = kdeconnect-indicator
  exec-once = udiskie -t
  exec-once = ~/.local/bin/toggleLeds
  # exec-once = ~/.local/bin/conky-start &
  exec-once = $terminal --class ncmpcpp -e ncmpcpp
#+end_src

Required packages(=archlinux=):
- blueman
- network-manager-applet
- polkit-kde-agent
- gnome-keyring
- udiskie
- dunst
- kdeconnect
- hyprpaper
- wl-clipboard
- bibata-cursor-theme
- hyprshade
- thunar
- hypridle

~/.local/bin/toggleLeds is just a script for calling another python scripts (see [[https://github.com/bigrand/scrolllock-wlroots-workaround/blob/main/ledToggler.py][here]] for the actual script) for toggling my keyboard leds. I use another bash script since I don't want to hardcode the input device location here.
#+begin_src bash :tangle no
  #!/usr/bin/env bash

  if ! $(pgrep ledToggler.py) &>/dev/null; then
      setsid ledToggler.py /dev/input/event4 scrolllock scrolllock 1 1
  fi
#+end_src
This is a very hacky solution, and it messes up my scrolling in /Emacs/. Should be removed when the leds handling is better in wayland, or buy better keyboard. And my keyboard description:
#+begin_quote
Bus 001 Device 003: ID 2a7a:9597  CASUE USB KB
#+end_quote
*** Additional GTK Settings
#+begin_src conf
  exec-once = gsettings set org.gnome.desktop.interface font-name "JetBrainsMonoNL Nerd Font Mono 8"
  exec-once = gsettings set org.gnome.desktop.interface cursor-theme Bibata-Modern-Classic
  exec-once = gsettings set org.gnome.desktop.interface cursor-size 24
  exec-once = gsettings set org.gnome.desktop.interface gtk-theme Breeze
  exec-once = gsettings set org.gnome.desktop.interface gtk-key-theme Emacs
  exec-once = gsettings set org.gnome.desktop.interface icon-theme Papirus
  exec-once = gsettings set org.gnome.desktop.interface color-scheme \'prefer-dark\'
  exec-once = gsettings set org.gnome.desktop.interface text-scaling-factor 0.9
  exec-once = gsettings set org.gnome.desktop.sound theme-name freedesktop
  exec-once = gsettings set org.gnome.desktop.sound input-feedback-sounds true
  exec-once = gsettings set org.gnome.desktop.sound allow-volume-above-100-percent true
#+end_src

Required packages(=archlinux=):
- [[https://archlinux.org/groups/x86_64/nerd-fonts/][nerd-fonts]]
- Breeze themes :: breeze, breeze-gtk and breeze-icons
- Emacs
- sound-theme-freedesktop
  
** =~/.config/hypr/hypr.d/variables.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/variables.conf :mkdirp t
:END:
*** Applications
#+begin_src conf
  $terminal = alacritty --config-file ~/.config/alacritty/alacritty-hyprland.toml
  $fileManager = thunar
  $menu = rofi -show drun -theme hyprland-menu
  $editor = emacsclient -c -a emacs
  $editor_term = emacsclient -t -a ""
  $mail = thunderbird
  $browser = firefox
#+end_src

*** Environment Variables
#+begin_src conf
  env = QT_QPA_PLATFORM,wayland
  env = QT_QPA_PLATFORMTHEME,qt5ct # change to qt6ct if you have that
  env = QT_AUTO_SCREEN_SCALE_FACTOR,1
  env = QT_QPA_PLATFORMTHEME, qt5ct
  env = QT_WAYLAND_DISABLE_WINDOWDECORATION,1
  env = SDL_VIDEODRIVER,wayland
  env = CLUTTER_BACKEND,wayland
  env = GTK_THEME,Breeze-Dark
  env = GTK2_RC_FILES,/usr/share/themes/Breeze-Dark/gtk-2.0
  env = XCURSOR_THEME,Bibata-Modern-Classic
  env = XCURSOR_SIZE,24
  env = HYPRCURSOR_THEME,Bibata-Modern-Classic
  env = HYPRCURSOR_SIZE,24
#+end_src

*** Wallpapers
This will set the wallpaper for each workspaces. The one I used is stored at my gitlab [[https://gitlab.com/alexforsale/wallpapers][repository]].
#+begin_src conf
  $w1 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/Minimal-Nord.png"
  $w2 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/linux-friends-4k.png"
  $w3 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/nord_buildings.png"
  $w4 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/keyboard.png"
  $w5 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/nord_lake.png"
  $w6 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/nord_alone_tree.png"
  $w7 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/nord_mountains.png"
  $w8 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/wild.png"
  $w9 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/nord_space.png"
  $w10 = hyprctl hyprpaper wallpaper ",~/.local/share/wallpapers/nord/nord_valley.png"
#+end_src

