index.html
<div id="outline-container-orgd7fbc19" class="outline-3">
<h3 id="orgd7fbc19"><code>~/.config/hypr/hypr.d/autostart.conf</code></h3>
<div class="outline-text-3" id="text-orgd7fbc19">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">exec-once</span> = systemctl --user import-environment WAYLAND_DISPLAY XDG_CURRENT_DESKTOP QT_QPA_PLATFORMTHEME SSH_AUTH_SOCK
<span style="color: #b8860b;">exec-once</span> = dbus-update-activation-environment --systemd --all &amp;
<span style="color: #b8860b;">exec-once</span> = /usr/lib/polkit-kde-authentication-agent-1 &amp;
<span style="color: #b8860b;">exec-once</span> = gnome-keyring-daemon --components=pkcs11,secrets,ssh -r -d &amp;
<span style="color: #b8860b;">exec-once</span> = dbus-launch --sh-syntax --exit-with-session dunst -conf ~/.config/dunst/dunstrc &amp;
<span style="color: #b8860b;">exec-once</span> = pgrep hypridle || hypridle
<span style="color: #b8860b;">exec-once</span> = waybar &amp;
<span style="color: #b8860b;">exec-once</span> = hyprpaper &amp;
<span style="color: #b8860b;">exec-once</span> = wl-paste --type text --watch cliphist store &amp;
<span style="color: #b8860b;">exec-once</span> = wl-paste --type image --watch cliphist store &amp;
<span style="color: #b8860b;">exec-once</span> = hyprctl setcursor Bibata-Modern-Classic 24
<span style="color: #b8860b;">exec-once</span> = hyprpm reload
<span style="color: #b8860b;">exec-once</span> = hyprshade auto &amp;
<span style="color: #b22222;"># </span><span style="color: #b22222;">exec-once = thunar --daemon &amp;</span>
<span style="color: #b8860b;">exec-once</span> = hypridle
<span style="color: #b8860b;">exec-once</span> = emacs --daemon &amp;
<span style="color: #b8860b;">exec-once</span> = blueman-applet &amp;
<span style="color: #b8860b;">exec-once</span> = blueman-tray &amp;
<span style="color: #b8860b;">exec-once</span> = nm-applet --indicator
<span style="color: #b8860b;">exec-once</span> = /usr/bin/kdeconnectd
<span style="color: #b8860b;">exec-once</span> = kdeconnect-indicator
<span style="color: #b8860b;">exec-once</span> = udiskie -t
<span style="color: #b8860b;">exec-once</span> = ~/.local/bin/toggleLeds
<span style="color: #b22222;"># </span><span style="color: #b22222;">exec-once = ~/.local/bin/conky-start &amp;</span>
<span style="color: #b8860b;">exec-once</span> = $terminal --class ncmpcpp -e ncmpcpp
</pre>
</div>

<p>
Required packages(<code>archlinux</code>):
</p>
<ul class="org-ul">
<li>blueman</li>
<li>network-manager-applet</li>
<li>polkit-kde-agent</li>
<li>gnome-keyring</li>
<li>udiskie</li>
<li>dunst</li>
<li>kdeconnect</li>
<li>hyprpaper</li>
<li>wl-clipboard</li>
<li>bibata-cursor-theme</li>
<li>hyprshade</li>
<li>thunar</li>
<li>hypridle</li>
</ul>

<p>
~/.local/bin/toggleLeds is just a script for calling another python scripts (see <a href="https://github.com/bigrand/scrolllock-wlroots-workaround/blob/main/ledToggler.py">here</a> for the actual script) for toggling my keyboard leds. I use another bash script since I don't want to hardcode the input device location here.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/usr/bin/</span><span style="color: #4169e1;">env</span><span style="color: #b22222;"> bash</span>

<span style="color: #4169e1;">if</span> ! $(<span style="font-weight: bold;">pgrep ledToggler.py</span>) &amp;&gt;/dev/null; <span style="color: #4169e1;">then</span>
    setsid ledToggler.py /dev/input/event4 scrolllock scrolllock 1 1
<span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
This is a very hacky solution, and it messes up my scrolling in <i>Emacs</i>. Should be removed when the leds handling is better in wayland, or buy better keyboard. And my keyboard description:
</p>
<blockquote>
<p>
Bus 001 Device 003: ID 2a7a:9597  CASUE USB KB
</p>
</blockquote>
</div>
<div id="outline-container-org3eb2a9e" class="outline-4">
<h4 id="org3eb2a9e">Additional GTK Settings</h4>
<div class="outline-text-4" id="text-org3eb2a9e">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface font-name <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono 8"</span>
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface cursor-theme Bibata-Modern-Classic
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface cursor-size 24
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface gtk-theme Breeze
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface gtk-key-theme Emacs
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface icon-theme Papirus
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface color-scheme \'prefer-dark\'
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.interface text-scaling-factor 0.9
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.sound theme-name freedesktop
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.sound input-feedback-sounds true
<span style="color: #b8860b;">exec-once</span> = gsettings set org.gnome.desktop.sound allow-volume-above-100-percent true
</pre>
</div>

<p>
Required packages(<code>archlinux</code>):
</p>
<ul class="org-ul">
<li><a href="https://archlinux.org/groups/x86_64/nerd-fonts/">nerd-fonts</a></li>
<li id="Breeze themes">breeze, breeze-gtk and breeze-icons</li>
<li>Emacs</li>
<li>sound-theme-freedesktop</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2f54f34" class="outline-3">
<h3 id="org2f54f34"><code>~/.config/hypr/hypr.d/variables.conf</code></h3>
<div class="outline-text-3" id="text-org2f54f34">
</div>
<div id="outline-container-org92fc913" class="outline-4">
<h4 id="org92fc913">Applications</h4>
<div class="outline-text-4" id="text-org92fc913">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">$terminal</span> = alacritty --config-file ~/.config/alacritty/alacritty-hyprland.toml
<span style="color: #b8860b;">$fileManager</span> = thunar
<span style="color: #b8860b;">$menu</span> = rofi -show drun -theme hyprland-menu
<span style="color: #b8860b;">$editor</span> = emacsclient -c -a emacs
<span style="color: #b8860b;">$editor_term</span> = emacsclient -t -a <span style="color: #bc8f8f;">""</span>
<span style="color: #b8860b;">$mail</span> = thunderbird
<span style="color: #b8860b;">$browser</span> = firefox
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cd9616" class="outline-4">
<h4 id="org5cd9616">Environment Variables</h4>
<div class="outline-text-4" id="text-org5cd9616">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">env</span> = QT_QPA_PLATFORM,wayland
<span style="color: #b8860b;">env</span> = QT_QPA_PLATFORMTHEME,qt5ct <span style="color: #b22222;"># </span><span style="color: #b22222;">change to qt6ct if you have that</span>
<span style="color: #b8860b;">env</span> = QT_AUTO_SCREEN_SCALE_FACTOR,1
<span style="color: #b8860b;">env</span> = QT_QPA_PLATFORMTHEME, qt5ct
<span style="color: #b8860b;">env</span> = QT_WAYLAND_DISABLE_WINDOWDECORATION,1
<span style="color: #b8860b;">env</span> = SDL_VIDEODRIVER,wayland
<span style="color: #b8860b;">env</span> = CLUTTER_BACKEND,wayland
<span style="color: #b8860b;">env</span> = GTK_THEME,Breeze-Dark
<span style="color: #b8860b;">env</span> = GTK2_RC_FILES,/usr/share/themes/Breeze-Dark/gtk-2.0
<span style="color: #b8860b;">env</span> = XCURSOR_THEME,Bibata-Modern-Classic
<span style="color: #b8860b;">env</span> = XCURSOR_SIZE,24
<span style="color: #b8860b;">env</span> = HYPRCURSOR_THEME,Bibata-Modern-Classic
<span style="color: #b8860b;">env</span> = HYPRCURSOR_SIZE,24
</pre>
</div>
</div>
</div>

<div id="outline-container-org8461449" class="outline-4">
<h4 id="org8461449">Wallpapers</h4>
<div class="outline-text-4" id="text-org8461449">
<p>
This will set the wallpaper for each workspaces. The one I used is stored at my gitlab <a href="https://gitlab.com/alexforsale/wallpapers">repository</a>.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">$w1</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/Minimal-Nord.png"</span>
<span style="color: #b8860b;">$w2</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/linux-friends-4k.png"</span>
<span style="color: #b8860b;">$w3</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/nord_buildings.png"</span>
<span style="color: #b8860b;">$w4</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/keyboard.png"</span>
<span style="color: #b8860b;">$w5</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/nord_lake.png"</span>
<span style="color: #b8860b;">$w6</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/nord_alone_tree.png"</span>
<span style="color: #b8860b;">$w7</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/nord_mountains.png"</span>
<span style="color: #b8860b;">$w8</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/wild.png"</span>
<span style="color: #b8860b;">$w9</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/nord_space.png"</span>
<span style="color: #b8860b;">$w10</span> = hyprctl hyprpaper wallpaper <span style="color: #bc8f8f;">",~/.local/share/wallpapers/nord/nord_valley.png"</span>
</pre>
</div>
</div>
</div>
</div>
