index.org
** =~/.config/hypr/hypr.d/input.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/input.conf :mkdirp t
:END:

#+begin_src conf
  input {
    kb_layout = us
    kb_variant =
    kb_model =
    kb_options =
    kb_rules =

    numlock_by_default = false

    repeat_rate = 35
    repeat_delay = 250

    follow_mouse = 1

    touchpad {
      natural_scroll = true
      disable_while_typing = true
      tap-to-click = true
      scroll_factor = 0.5
    }

    sensitivity = 0 # -1.0 - 1.0, 0 means no modification.
    special_fallthrough = true
  }
#+end_src

** =~/.config/hypr/hypr.d/general.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/general.conf :mkdirp t
:END:

#+begin_src conf
  general {
    # See https://wiki.hyprland.org/Configuring/Variables/ for more

    gaps_in = 4
    gaps_out = 5
    gaps_workspaces = 50
    border_size = 1
    col.active_border = rgb(268bd2)
    col.inactive_border = rgb(6c7c80)
    #col.nogroup_border=0xff89dceb
    #col.nogroup_border_active=0xfff9e2af

    resize_on_border = true
    no_focus_fallback = true
    layout = dwindle

    # Please see https://wiki.hyprland.org/Configuring/Tearing/ before you turn this on
    allow_tearing = true
    snap {
      enabled = true
      window_gap = 5
      monitor_gap = 30
      #respect_gaps = true
    }
  }
#+end_src

** =~/.config/hypr/hypr.d/decoration.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/decoration.conf :mkdirp t
:END:

#+begin_src conf
  decoration {
      # See https://wiki.hyprland.org/Configuring/Variables/ for more

      rounding = 20
      active_opacity = 0.9
      inactive_opacity = 0.25
      fullscreen_opacity = 1

      blur {
        enabled = true
        xray = true
        special = false
        new_optimizations = true
        size = 14
        passes = 4
        brightness = 1
        noise = 0.01
        contrast = 1
        popups = true
        popups_ignorealpha = 0.6
      }

      shadow {
          enabled = true
          ignore_window = true
          render_power = 4
          range = 20
          offset = 0 2
          color = rgba(0000002A)
      }

      dim_inactive = true
      dim_strength = 0.1
      dim_special = 0
  }
#+end_src

** =~/.config/hypr/hypr.d/animations.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/animations.conf :mkdirp t
:END:

#+begin_src conf
  animations {
    enabled = true
    workspace_wraparound = true

    # Some default animations, see https://wiki.hyprland.org/Configuring/Animations/ for more

    bezier = linear, 0, 0, 1, 1
    bezier = md3_standard, 0.2, 0, 0, 1
    bezier = md3_decel, 0.05, 0.7, 0.1, 1
    bezier = md3_accel, 0.3, 0, 0.8, 0.15
    bezier = overshot, 0.05, 0.9, 0.1, 1.1
    bezier = crazyshot, 0.1, 1.5, 0.76, 0.92
    bezier = hyprnostretch, 0.05, 0.9, 0.1, 1.0
    bezier = menu_decel, 0.1, 1, 0, 1
    bezier = menu_accel, 0.38, 0.04, 1, 0.07
    bezier = easeInOutCirc, 0.85, 0, 0.15, 1
    bezier = easeOutCirc, 0, 0.55, 0.45, 1
    bezier = easeOutExpo, 0.16, 1, 0.3, 1
    bezier = softAcDecel, 0.26, 0.26, 0.15, 1
    bezier = md2, 0.4, 0, 0.2, 1 # use with .2s duration

    animation = windows, 1, 3, md3_decel, popin 60%
    animation = windowsIn, 1, 3, md3_decel, popin 60%
    animation = windowsOut, 1, 3, md3_accel, popin 60%
    animation = border, 1, 10, default
    animation = fade, 1, 3, md3_decel

    animation = layersIn, 1, 3, menu_decel, slide
    animation = layersOut, 1, 1.6, menu_accel
    animation = fadeLayersIn, 1, 2, menu_decel
    animation = fadeLayersOut, 1, 4.5, menu_accel
    animation = workspaces, 1, 7, menu_decel, slide

    animation = specialWorkspace, 1, 3, md3_decel, slidevert
  }
#+end_src
** =~/.config/hypr/hypr.d/dwindle.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/dwindle.conf :mkdirp t
:END:

#+begin_src conf
  dwindle {
    # See https://wiki.hyprland.org/Configuring/Dwindle-Layout/ for more
    pseudotile = yes # master switch for pseudotiling. Enabling is bound to mainMod + P in the keybinds section below
    preserve_split = true # you probably want this
    smart_split = false
    smart_resizing = false
  }
#+end_src
** =~/.config/hypr/hypr.d/master.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/master.conf :mkdirp t
:END:

#+begin_src conf
  master {
    # See https://wiki.hyprland.org/Configuring/Master-Layout/ for more
  }
#+end_src
** =~/.config/hypr/hypr.d/gestures.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/gestures.conf :mkdirp t
:END:

#+begin_src conf
  gestures {
    # See https://wiki.hyprland.org/Configuring/Variables/ for more
    workspace_swipe = true
    workspace_swipe_distance = 700
    workspace_swipe_fingers = 3
    workspace_swipe_cancel_ratio = 0.2
    workspace_swipe_min_speed_to_force = 5
    workspace_swipe_direction_lock = true
    workspace_swipe_direction_lock_threshold = 10
    workspace_swipe_create_new = true
  }
#+end_src
