index.html

<div id="outline-container-org9027ac3" class="outline-3">
<h3 id="org9027ac3"><code>~/.config/hypr/hypr.d/input.conf</code></h3>
<div class="outline-text-3" id="text-org9027ac3">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">input</span> {
  <span style="color: #b8860b;">kb_layout</span> = us
  <span style="color: #b8860b;">kb_variant</span> =
  <span style="color: #b8860b;">kb_model</span> =
  <span style="color: #b8860b;">kb_options</span> =
  <span style="color: #b8860b;">kb_rules</span> =

  <span style="color: #b8860b;">numlock_by_default</span> = false

  <span style="color: #b8860b;">repeat_rate</span> = 35
  <span style="color: #b8860b;">repeat_delay</span> = 250

  <span style="color: #b8860b;">follow_mouse</span> = 1

  <span style="color: #228b22;">touchpad</span> {
    <span style="color: #b8860b;">natural_scroll</span> = true
    <span style="color: #b8860b;">disable_while_typing</span> = true
    <span style="color: #b8860b;">tap-to-click</span> = true
    <span style="color: #b8860b;">scroll_factor</span> = 0.5
  }

  <span style="color: #b8860b;">sensitivity</span> = 0 <span style="color: #b22222;"># </span><span style="color: #b22222;">-1.0 - 1.0, 0 means no modification.</span>
  <span style="color: #b8860b;">special_fallthrough</span> = true
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc069b3f" class="outline-3">
<h3 id="orgc069b3f"><code>~/.config/hypr/hypr.d/general.conf</code></h3>
<div class="outline-text-3" id="text-orgc069b3f">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">general</span> {
  <span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Variables/ for more</span>

  <span style="color: #b8860b;">gaps_in</span> = 4
  <span style="color: #b8860b;">gaps_out</span> = 5
  <span style="color: #b8860b;">gaps_workspaces</span> = 50
  <span style="color: #b8860b;">border_size</span> = 1
  <span style="color: #b8860b;">col.active_border</span> = rgb(268bd2)
  <span style="color: #b8860b;">col.inactive_border</span> = rgb(6c7c80)
  <span style="color: #b22222;">#</span><span style="color: #b22222;">col.nogroup_border=0xff89dceb</span>
  <span style="color: #b22222;">#</span><span style="color: #b22222;">col.nogroup_border_active=0xfff9e2af</span>

  <span style="color: #b8860b;">resize_on_border</span> = true
  <span style="color: #b8860b;">no_focus_fallback</span> = true
  <span style="color: #b8860b;">layout</span> = dwindle

  <span style="color: #b22222;"># </span><span style="color: #b22222;">Please see https://wiki.hyprland.org/Configuring/Tearing/ before you turn this on</span>
  <span style="color: #b8860b;">allow_tearing</span> = true
  <span style="color: #228b22;">snap</span> {
    <span style="color: #b8860b;">enabled</span> = true
    <span style="color: #b8860b;">window_gap</span> = 5
    <span style="color: #b8860b;">monitor_gap</span> = 30
    <span style="color: #b22222;">#</span><span style="color: #b22222;">respect_gaps = true</span>
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc6f0eee" class="outline-3">
<h3 id="orgc6f0eee"><code>~/.config/hypr/hypr.d/decoration.conf</code></h3>
<div class="outline-text-3" id="text-orgc6f0eee">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">decoration</span> {
    <span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Variables/ for more</span>

    <span style="color: #b8860b;">rounding</span> = 20
    <span style="color: #b8860b;">active_opacity</span> = 0.9
    <span style="color: #b8860b;">inactive_opacity</span> = 0.25
    <span style="color: #b8860b;">fullscreen_opacity</span> = 1

    <span style="color: #228b22;">blur</span> {
      <span style="color: #b8860b;">enabled</span> = true
      <span style="color: #b8860b;">xray</span> = true
      <span style="color: #b8860b;">special</span> = false
      <span style="color: #b8860b;">new_optimizations</span> = true
      <span style="color: #b8860b;">size</span> = 14
      <span style="color: #b8860b;">passes</span> = 4
      <span style="color: #b8860b;">brightness</span> = 1
      <span style="color: #b8860b;">noise</span> = 0.01
      <span style="color: #b8860b;">contrast</span> = 1
      <span style="color: #b8860b;">popups</span> = true
      <span style="color: #b8860b;">popups_ignorealpha</span> = 0.6
    }

    <span style="color: #228b22;">shadow</span> {
        <span style="color: #b8860b;">enabled</span> = true
        <span style="color: #b8860b;">ignore_window</span> = true
        <span style="color: #b8860b;">render_power</span> = 4
        <span style="color: #b8860b;">range</span> = 20
        <span style="color: #b8860b;">offset</span> = 0 2
        <span style="color: #b8860b;">color</span> = rgba(0000002A)
    }

    <span style="color: #b8860b;">dim_inactive</span> = true
    <span style="color: #b8860b;">dim_strength</span> = 0.1
    <span style="color: #b8860b;">dim_special</span> = 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org72b17b5" class="outline-3">
<h3 id="org72b17b5"><code>~/.config/hypr/hypr.d/animations.conf</code></h3>
<div class="outline-text-3" id="text-org72b17b5">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">animations</span> {
  <span style="color: #b8860b;">enabled</span> = true
  <span style="color: #b8860b;">workspace_wraparound</span> = true

  <span style="color: #b22222;"># </span><span style="color: #b22222;">Some default animations, see https://wiki.hyprland.org/Configuring/Animations/ for more</span>

  <span style="color: #b8860b;">bezier</span> = linear, 0, 0, 1, 1
  <span style="color: #b8860b;">bezier</span> = md3_standard, 0.2, 0, 0, 1
  <span style="color: #b8860b;">bezier</span> = md3_decel, 0.05, 0.7, 0.1, 1
  <span style="color: #b8860b;">bezier</span> = md3_accel, 0.3, 0, 0.8, 0.15
  <span style="color: #b8860b;">bezier</span> = overshot, 0.05, 0.9, 0.1, 1.1
  <span style="color: #b8860b;">bezier</span> = crazyshot, 0.1, 1.5, 0.76, 0.92
  <span style="color: #b8860b;">bezier</span> = hyprnostretch, 0.05, 0.9, 0.1, 1.0
  <span style="color: #b8860b;">bezier</span> = menu_decel, 0.1, 1, 0, 1
  <span style="color: #b8860b;">bezier</span> = menu_accel, 0.38, 0.04, 1, 0.07
  <span style="color: #b8860b;">bezier</span> = easeInOutCirc, 0.85, 0, 0.15, 1
  <span style="color: #b8860b;">bezier</span> = easeOutCirc, 0, 0.55, 0.45, 1
  <span style="color: #b8860b;">bezier</span> = easeOutExpo, 0.16, 1, 0.3, 1
  <span style="color: #b8860b;">bezier</span> = softAcDecel, 0.26, 0.26, 0.15, 1
  <span style="color: #b8860b;">bezier</span> = md2, 0.4, 0, 0.2, 1 <span style="color: #b22222;"># </span><span style="color: #b22222;">use with .2s duration</span>

  <span style="color: #b8860b;">animation</span> = windows, 1, 3, md3_decel, popin 60%
  <span style="color: #b8860b;">animation</span> = windowsIn, 1, 3, md3_decel, popin 60%
  <span style="color: #b8860b;">animation</span> = windowsOut, 1, 3, md3_accel, popin 60%
  <span style="color: #b8860b;">animation</span> = border, 1, 10, default
  <span style="color: #b8860b;">animation</span> = fade, 1, 3, md3_decel

  <span style="color: #b8860b;">animation</span> = layersIn, 1, 3, menu_decel, slide
  <span style="color: #b8860b;">animation</span> = layersOut, 1, 1.6, menu_accel
  <span style="color: #b8860b;">animation</span> = fadeLayersIn, 1, 2, menu_decel
  <span style="color: #b8860b;">animation</span> = fadeLayersOut, 1, 4.5, menu_accel
  <span style="color: #b8860b;">animation</span> = workspaces, 1, 7, menu_decel, slide

  <span style="color: #b8860b;">animation</span> = specialWorkspace, 1, 3, md3_decel, slidevert
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfbff780" class="outline-3">
<h3 id="orgfbff780"><code>~/.config/hypr/hypr.d/dwindle.conf</code></h3>
<div class="outline-text-3" id="text-orgfbff780">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">dwindle</span> {
  <span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Dwindle-Layout/ for more</span>
  <span style="color: #b8860b;">pseudotile</span> = yes <span style="color: #b22222;"># </span><span style="color: #b22222;">master switch for pseudotiling. Enabling is bound to mainMod + P in the keybinds section below</span>
  <span style="color: #b8860b;">preserve_split</span> = true <span style="color: #b22222;"># </span><span style="color: #b22222;">you probably want this</span>
  <span style="color: #b8860b;">smart_split</span> = false
  <span style="color: #b8860b;">smart_resizing</span> = false
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org97b19b0" class="outline-3">
<h3 id="org97b19b0"><code>~/.config/hypr/hypr.d/master.conf</code></h3>
<div class="outline-text-3" id="text-org97b19b0">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">master</span> {
  <span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Master-Layout/ for more</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0685b14" class="outline-3">
<h3 id="org0685b14"><code>~/.config/hypr/hypr.d/gestures.conf</code></h3>
<div class="outline-text-3" id="text-org0685b14">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">gestures</span> {
  <span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Variables/ for more</span>
  <span style="color: #b8860b;">workspace_swipe</span> = true
  <span style="color: #b8860b;">workspace_swipe_distance</span> = 700
  <span style="color: #b8860b;">workspace_swipe_fingers</span> = 3
  <span style="color: #b8860b;">workspace_swipe_cancel_ratio</span> = 0.2
  <span style="color: #b8860b;">workspace_swipe_min_speed_to_force</span> = 5
  <span style="color: #b8860b;">workspace_swipe_direction_lock</span> = true
  <span style="color: #b8860b;">workspace_swipe_direction_lock_threshold</span> = 10
  <span style="color: #b8860b;">workspace_swipe_create_new</span> = true
}
</pre>
</div>
</div>
</div>
