index.org
** =~/.config/hypr/hypr.d/groups.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/groups.conf :mkdirp t
:END:

#+begin_src conf
  group {
    insert_after_current = true
    focus_removed_window = true
    col.border_active = rgb(268bd2)
    col.border_inactive = rgb(6c7c80)
    col.border_locked_active = rgb(d33682)
    col.border_locked_inactive = rgb(b58900)
    drag_into_group = 2
    groupbar {
      enabled = true
      font_family = "JetBrainsMonoNL Nerd Font Mono 8"
      font_size = 8
      gradients = true
      height = 14
      priority = 3
      render_titles = true
      scrolling = true
      text_color = rgb(fdf6e3)
      col.active = rgb(268bd2)
      col.inactive = rgb(6c7c80)
      col.locked_active = rgb(dc322f)
      col.locked_inactive = rgb(073642)
    }
  }
#+end_src
** =~/.config/hypr/hypr.d/binds.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/binds.conf :mkdirp t
:END:

#+begin_src conf
  binds {
    workspace_back_and_forth = false
    allow_workspace_cycles = true
    scroll_event_delay = 0
  }
#+end_src

** =~/.config/hypr/hypr.d/misc.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/misc.conf :mkdirp t
:END:

#+begin_src conf
  misc {
    # See https://wiki.hyprland.org/Configuring/Variables/ for more
    vfr = 1
    vrr = 3
    focus_on_activate = false
    animate_manual_resizes = true
    animate_mouse_windowdragging = false
    enable_swallow = false
    swallow_regex = (foot|kitty|allacritty|Alacritty)
    force_default_wallpaper = 0 # Set to 0 or 1 to disable the anime mascot wallpapers
    disable_hyprland_logo = true
    disable_splash_rendering = false
    mouse_move_enables_dpms = true
    key_press_enables_dpms = true
    mouse_move_focuses_monitor = true
    new_window_takes_over_fullscreen = 2
    allow_session_lock_restore = true
    initial_workspace_tracking = false
  }
#+end_src
** =~/.config/hypr/hypr.d/devices.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/devices.conf :mkdirp t
:END:

#+begin_src conf
  device {
    name = epic-mouse-v1
    sensitivity = -0.5
  }
#+end_src
** =~/.config/hypr/hypr.d/windowrule.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/windowrule.conf :mkdirp t
:END:
*** For all windows
#+begin_src conf
  windowrule = noblur,class:.*
  windowrulev2 = suppressevent maximize, class:.* # You'll probably like this.
  windowrulev2 = opacity 0.99, class:.*
#+end_src

*** =pavucontrol=
#+begin_src conf
  windowrulev2 = float,class:^(pavucontrol)$
  windowrulev2 = size 50%,class:^(pavucontrol)$
#+end_src
*** =pwvucontrol=
#+begin_src conf
  windowrulev2 = float,class:^(com.saivert.pwvucontrol)$
  windowrulev2 = size 50%,class:^(com.saivert.pwvucontrol)$
#+end_src
*** =polkit-kde-agent=
#+begin_src conf
  windowrulev2 = float,class:(org.kde.polkit-kde-authentication-agent-1)
  windowrulev2 = center,class:(org.kde.polkit-kde-authentication-agent-1)
#+end_src

*** =blueman=
#+begin_src conf
  windowrulev2 = float,class:(blueman)
  windowrulev2 = center,class:(blueman)
  windowrulev2 = size 50%,class:(blueman)
#+end_src

*** =thunderbird=
#+begin_src conf
  windowrulev2 = float,class:(thunderbird),title:(status)
  windowrulev2 = float,class:(thunderbird),title:(.*)(Reminders)
  windowrulev2 = float,class:(thunderbird),title:(Write:.*)
  windowrulev2 = float,class:(thunderbird),title:(Send.*)
  windowrulev2 = float,class:(thunderbird),title:(Inbox.*)
  windowrulev2 = float,class:(Msgcompose.*)
  windowrulev2 = float, class:(thunderbird),title(.*)(Reminders)$
  windowrulev2 = workspace 4, class:(thunderbird)
#+end_src

*** =firefox=
#+begin_src conf
  windowrulev2 = idleinhibit always, class:firefox title:(.*)(- YouTube)
  windowrulev2 = opacity 1, class:firefox title:(.*)(- YouTube)
#+end_src

*** =Qtpass= 
#+begin_src conf
  windowrulev2 = float,class:(QtPass)
#+end_src

*** =zoom=
#+begin_src conf
  windowrulev2 = float,class:(zoom)
  windowrulev2 = opacity 1, class:(zoom)
  windowrulev2 = workspace 10, class:(zoom)
  windowrulev2 = opacity 1, class:(zoom), title:(Settings)
  windowrulev2 = opacity 1, class:(zoom), title:(Zoom Meeting)
#+end_src

*** =file-roller=
#+begin_src conf
  windowrulev2 = float, class:(file-roller)
  windowrulev2 = float, class:(org.gnome.FileRoller)
  windowrulev2 = float, title:(Compress)
#+end_src

*** =ncmpcpp=
#+begin_src conf
  windowrulev2 = float,class:(ncmpcpp)
  windowrulev2 = center,class:(ncmpcpp)
  windowrulev2 = size 50%,class:(ncmpcpp)
  windowrulev2 = workspace special:music,class:(ncmpcpp)
#+end_src

*** =khal=
#+begin_src conf
  windowrulev2 = float, class:(khal)
  windowrulev2 = size 40%, class:(khal)
  windowrulev2 = move onscreen cursor 50% 5%, class:(khal)
#+end_src

