index.html
<div id="outline-container-orgc38a45d" class="outline-3">
<h3 id="orgc38a45d"><code>~/.config/hypr/hypr.d/groups.conf</code></h3>
<div class="outline-text-3" id="text-orgc38a45d">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">group</span> {
  <span style="color: #b8860b;">insert_after_current</span> = true
  <span style="color: #b8860b;">focus_removed_window</span> = true
  <span style="color: #b8860b;">col.border_active</span> = rgb(268bd2)
  <span style="color: #b8860b;">col.border_inactive</span> = rgb(6c7c80)
  <span style="color: #b8860b;">col.border_locked_active</span> = rgb(d33682)
  <span style="color: #b8860b;">col.border_locked_inactive</span> = rgb(b58900)
  <span style="color: #b8860b;">drag_into_group</span> = 2
  <span style="color: #228b22;">groupbar</span> {
    <span style="color: #b8860b;">enabled</span> = true
    <span style="color: #b8860b;">font_family</span> = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono 8"</span>
    <span style="color: #b8860b;">font_size</span> = 8
    <span style="color: #b8860b;">gradients</span> = true
    <span style="color: #b8860b;">height</span> = 14
    <span style="color: #b8860b;">priority</span> = 3
    <span style="color: #b8860b;">render_titles</span> = true
    <span style="color: #b8860b;">scrolling</span> = true
    <span style="color: #b8860b;">text_color</span> = rgb(fdf6e3)
    <span style="color: #b8860b;">col.active</span> = rgb(268bd2)
    <span style="color: #b8860b;">col.inactive</span> = rgb(6c7c80)
    <span style="color: #b8860b;">col.locked_active</span> = rgb(dc322f)
    <span style="color: #b8860b;">col.locked_inactive</span> = rgb(073642)
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3949cc7" class="outline-3">
<h3 id="org3949cc7"><code>~/.config/hypr/hypr.d/binds.conf</code></h3>
<div class="outline-text-3" id="text-org3949cc7">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">binds</span> {
  <span style="color: #b8860b;">workspace_back_and_forth</span> = false
  <span style="color: #b8860b;">allow_workspace_cycles</span> = true
  <span style="color: #b8860b;">scroll_event_delay</span> = 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b98f55" class="outline-3">
<h3 id="org1b98f55"><code>~/.config/hypr/hypr.d/misc.conf</code></h3>
<div class="outline-text-3" id="text-org1b98f55">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">misc</span> {
  <span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Variables/ for more</span>
  <span style="color: #b8860b;">vfr</span> = 1
  <span style="color: #b8860b;">vrr</span> = 3
  <span style="color: #b8860b;">focus_on_activate</span> = false
  <span style="color: #b8860b;">animate_manual_resizes</span> = true
  <span style="color: #b8860b;">animate_mouse_windowdragging</span> = false
  <span style="color: #b8860b;">enable_swallow</span> = false
  <span style="color: #b8860b;">swallow_regex</span> = (foot|kitty|allacritty|Alacritty)
  <span style="color: #b8860b;">force_default_wallpaper</span> = 0 <span style="color: #b22222;"># </span><span style="color: #b22222;">Set to 0 or 1 to disable the anime mascot wallpapers</span>
  <span style="color: #b8860b;">disable_hyprland_logo</span> = true
  <span style="color: #b8860b;">disable_splash_rendering</span> = false
  <span style="color: #b8860b;">mouse_move_enables_dpms</span> = true
  <span style="color: #b8860b;">key_press_enables_dpms</span> = true
  <span style="color: #b8860b;">mouse_move_focuses_monitor</span> = true
  <span style="color: #b8860b;">new_window_takes_over_fullscreen</span> = 2
  <span style="color: #b8860b;">allow_session_lock_restore</span> = true
  <span style="color: #b8860b;">initial_workspace_tracking</span> = false
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac43d8f" class="outline-3">
<h3 id="orgac43d8f"><code>~/.config/hypr/hypr.d/devices.conf</code></h3>
<div class="outline-text-3" id="text-orgac43d8f">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">device</span> {
  <span style="color: #b8860b;">name</span> = epic-mouse-v1
  <span style="color: #b8860b;">sensitivity</span> = -0.5
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc511fa" class="outline-3">
<h3 id="orgcc511fa"><code>~/.config/hypr/hypr.d/windowrule.conf</code></h3>
<div class="outline-text-3" id="text-orgcc511fa">
</div>
<div id="outline-container-orgd434e76" class="outline-4">
<h4 id="orgd434e76">For all windows</h4>
<div class="outline-text-4" id="text-orgd434e76">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrule</span> = noblur,class:.*
<span style="color: #b8860b;">windowrulev2</span> = suppressevent maximize, class:.* <span style="color: #b22222;"># </span><span style="color: #b22222;">You'll probably like this.</span>
<span style="color: #b8860b;">windowrulev2</span> = opacity 0.99, class:.*
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b28a6b" class="outline-4">
<h4 id="org2b28a6b"><code>pavucontrol</code></h4>
<div class="outline-text-4" id="text-org2b28a6b">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:^(pavucontrol)$
<span style="color: #b8860b;">windowrulev2</span> = size 50%,class:^(pavucontrol)$
</pre>
</div>
</div>
</div>
<div id="outline-container-org6932ef5" class="outline-4">
<h4 id="org6932ef5"><code>pwvucontrol</code></h4>
<div class="outline-text-4" id="text-org6932ef5">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:^(com.saivert.pwvucontrol)$
<span style="color: #b8860b;">windowrulev2</span> = size 50%,class:^(com.saivert.pwvucontrol)$
</pre>
</div>
</div>
</div>
<div id="outline-container-org968744c" class="outline-4">
<h4 id="org968744c"><code>polkit-kde-agent</code></h4>
<div class="outline-text-4" id="text-org968744c">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:(org.kde.polkit-kde-authentication-agent-1)
<span style="color: #b8860b;">windowrulev2</span> = center,class:(org.kde.polkit-kde-authentication-agent-1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d26ee5" class="outline-4">
<h4 id="org4d26ee5"><code>blueman</code></h4>
<div class="outline-text-4" id="text-org4d26ee5">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:(blueman)
<span style="color: #b8860b;">windowrulev2</span> = center,class:(blueman)
<span style="color: #b8860b;">windowrulev2</span> = size 50%,class:(blueman)
</pre>
</div>
</div>
</div>

<div id="outline-container-org28b74fb" class="outline-4">
<h4 id="org28b74fb"><code>thunderbird</code></h4>
<div class="outline-text-4" id="text-org28b74fb">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:(thunderbird),title:(status)
<span style="color: #b8860b;">windowrulev2</span> = float,class:(thunderbird),title:(.*)(Reminders)
<span style="color: #b8860b;">windowrulev2</span> = float,class:(thunderbird),title:(Write:.*)
<span style="color: #b8860b;">windowrulev2</span> = float,class:(thunderbird),title:(Send.*)
<span style="color: #b8860b;">windowrulev2</span> = float,class:(thunderbird),title:(Inbox.*)
<span style="color: #b8860b;">windowrulev2</span> = float,class:(Msgcompose.*)
<span style="color: #b8860b;">windowrulev2</span> = float, class:(thunderbird),title(.*)(Reminders)$
<span style="color: #b8860b;">windowrulev2</span> = workspace 4, class:(thunderbird)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfb3868" class="outline-4">
<h4 id="orgdfb3868"><code>firefox</code></h4>
<div class="outline-text-4" id="text-orgdfb3868">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = idleinhibit always, class:firefox title:(.*)(- YouTube)
<span style="color: #b8860b;">windowrulev2</span> = opacity 1, class:firefox title:(.*)(- YouTube)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4682f57" class="outline-4">
<h4 id="org4682f57"><code>Qtpass</code></h4>
<div class="outline-text-4" id="text-org4682f57">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:(QtPass)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge934005" class="outline-4">
<h4 id="orge934005"><code>zoom</code></h4>
<div class="outline-text-4" id="text-orge934005">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:(zoom)
<span style="color: #b8860b;">windowrulev2</span> = opacity 1, class:(zoom)
<span style="color: #b8860b;">windowrulev2</span> = workspace 10, class:(zoom)
<span style="color: #b8860b;">windowrulev2</span> = opacity 1, class:(zoom), title:(Settings)
<span style="color: #b8860b;">windowrulev2</span> = opacity 1, class:(zoom), title:(Zoom Meeting)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge16f3fb" class="outline-4">
<h4 id="orge16f3fb"><code>file-roller</code></h4>
<div class="outline-text-4" id="text-orge16f3fb">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(file-roller)
<span style="color: #b8860b;">windowrulev2</span> = float, class:(org.gnome.FileRoller)
<span style="color: #b8860b;">windowrulev2</span> = float, title:(Compress)
</pre>
</div>
</div>
</div>

<div id="outline-container-org06b2b13" class="outline-4">
<h4 id="org06b2b13"><code>ncmpcpp</code></h4>
<div class="outline-text-4" id="text-org06b2b13">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float,class:(ncmpcpp)
<span style="color: #b8860b;">windowrulev2</span> = center,class:(ncmpcpp)
<span style="color: #b8860b;">windowrulev2</span> = size 50%,class:(ncmpcpp)
<span style="color: #b8860b;">windowrulev2</span> = workspace special:music,class:(ncmpcpp)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd7c7b6" class="outline-4">
<h4 id="orgcd7c7b6"><code>khal</code></h4>
<div class="outline-text-4" id="text-orgcd7c7b6">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(khal)
<span style="color: #b8860b;">windowrulev2</span> = size 40%, class:(khal)
<span style="color: #b8860b;">windowrulev2</span> = move onscreen cursor 50% 5%, class:(khal)
</pre>
</div>
</div>
</div>
