index.org
*** =astroid=
#+begin_src conf
  windowrulev2 = workspace 4, class:(astroid)
  windowrulev2 = maximize, class:(astroid)
#+end_src

*** =vlc=
#+begin_src conf
  windowrulev2 = workspace 7,class:(vlc)
  windowrulev2 = opacity 1,class:(vlc)
  windowrulev2 = idleinhibit always,class:(vlc)
#+end_src

*** =remmina=
#+begin_src conf
  windowrulev2 = float, workspace 8, class:(org.remmina.Remmina)
#+end_src
*** libvirt / virt-manager
#+begin_src conf
  windowrulev2 = float, workspace 9, class:(virt-manager), initialTitle:(QEMU/KVM - Connection Details)
  windowrulev2 = float, workspace 9, class:(virt-manager), initialTitle:(.*on QEMU/KVM)
#+end_src
*** =transmission=
#+begin_src conf
  windowrulev2 = workspace 9,class:^(com.transmissionbt.transmission).*
  windowrulev2 = float,title:(Torrent.*)
#+end_src

*** dialogs
#+begin_src conf
  windowrule=float,title:^(Open File)(.*)$
  windowrule=float,title:^(Select a File)(.*)$
  windowrule=float,title:^(Choose wallpaper)(.*)$
  windowrule=float,title:^(Open Folder)(.*)$
  windowrule=float,title:^(Save As)(.*)$
  windowrule=float,title:^(Library)(.*)$
  windowrule=float,title:^(File Upload)(.*)$
#+end_src

*** =thunar=
#+begin_src conf
  windowrule = center, title:^(Open File)(.*)$
  windowrule = center, title:^(Rename.*)(.*)$
  windowrule = center, title:^(Select a File)(.*)$
  windowrule = center, title:^(Choose wallpaper)(.*)$
  windowrule = center, title:^(Open Folder)(.*)$
  windowrule = center, title:^(Save As)(.*)$
  windowrule = center, title:^(Library)(.*)$
  windowrule = center, title:^(File Upload)(.*)$
  windowrulev2 = float, title:(Rename.*)
  windowrulev2 = float, title:(File Operation Progress)
  windowrulev2 = float, class:(thunar),title:(Confirm to replace files)
#+end_src

*** no tearing
#+begin_src conf
  windowrulev2 = noshadow,floating:0
#+end_src

*** =htop=
#+begin_src conf
  windowrulev2 = float, class:(htop)
  windowrulev2 = size 100% 40%, class:(htop)
  windowrulev2 = move 0 40, class:(htop)
#+end_src

*** =nmtui=
#+begin_src conf
  windowrulev2 = float, class:(nmtui)
#+end_src

*** =vim=
#+begin_src conf
  windowrulev2 = float, class:(vim)
  windowrulev2 = maximize, class:(vim)
#+end_src

*** =Emacs= (in terminal mode)
#+begin_src conf
  windowrulev2 = maximize, class:(nw-emacs)
#+end_src

*** =showmethekey=
#+begin_src conf
  windowrulev2 = float, class:(one.alynx.showmethekey), title:(Show Me The Key)
  windowrulev2 = nofocus, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
  windowrulev2 = opacity 0.4, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
  windowrulev2 = center, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
  windowrulev2 = float, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
  windowrulev2 = pin, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
  windowrulev2 = size 100% 10%, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
  windowrulev2 = move 0 90%, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
#+end_src
*** =screenkey= 
#+begin_src conf
  windowrulev2 = float, class:(screenkey)
#+end_src
*** steam
#+begin_src conf
  windowrulev2 = opacity 1, class:(steam) initialTitle:(.*)
  windowrulev2 = float, class:(steam) initialTitle:(.*)
  windowrule=immediate,class:.*\.exe
  windowrulev2=immediate,class:(steam_app)
#+end_src
**** Mount & Blade Warband
#+begin_src conf
  windowrulev2 = opacity 1, class:(mb_warband_linux) initialTitle:(mb_warband_linux)
#+end_src
*** conky
#+begin_src conf
  # windowrulev2 = noinitialfocus, class:(Conky)
  windowrulev2 = nofocus, class:(Conky)
  windowrulev2 = pseudo, class:(Conky)
  windowrulev2 = pin, class:(Conky)
  # windowrulev2 = suppressevent activate activatefocus, class:(Conky)
  windowrulev2 = opacity 1 override 0.5, class:(Conky)
#+end_src
*** easyeffect
#+begin_src conf
  windowrulev2 = float, title:(Easy Effects)
  windowrulev2 = size 100% 60%, title:(Easy Effects)
#+end_src
