index.html

<div id="outline-container-orgae9a8ed" class="outline-4">
<h4 id="orgae9a8ed"><code>astroid</code></h4>
<div class="outline-text-4" id="text-orgae9a8ed">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = workspace 4, class:(astroid)
<span style="color: #b8860b;">windowrulev2</span> = maximize, class:(astroid)
</pre>
</div>
</div>
</div>

<div id="outline-container-org39347d4" class="outline-4">
<h4 id="org39347d4"><code>vlc</code></h4>
<div class="outline-text-4" id="text-org39347d4">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = workspace 7,class:(vlc)
<span style="color: #b8860b;">windowrulev2</span> = opacity 1,class:(vlc)
<span style="color: #b8860b;">windowrulev2</span> = idleinhibit always,class:(vlc)
</pre>
</div>
</div>
</div>

<div id="outline-container-org22306da" class="outline-4">
<h4 id="org22306da"><code>remmina</code></h4>
<div class="outline-text-4" id="text-org22306da">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, workspace 8, class:(org.remmina.Remmina)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b6674c" class="outline-4">
<h4 id="org5b6674c">libvirt / virt-manager</h4>
<div class="outline-text-4" id="text-org5b6674c">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, workspace 9, class:(virt-manager), initialTitle:(QEMU/KVM - Connection Details)
<span style="color: #b8860b;">windowrulev2</span> = float, workspace 9, class:(virt-manager), initialTitle:(.*on QEMU/KVM)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0dd8ae9" class="outline-4">
<h4 id="org0dd8ae9"><code>transmission</code></h4>
<div class="outline-text-4" id="text-org0dd8ae9">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = workspace 9,class:^(com.transmissionbt.transmission).*
<span style="color: #b8860b;">windowrulev2</span> = float,title:(Torrent.*)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6a4eb6" class="outline-4">
<h4 id="orgd6a4eb6">dialogs</h4>
<div class="outline-text-4" id="text-orgd6a4eb6">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrule</span>=float,title:^(Open File)(.*)$
<span style="color: #b8860b;">windowrule</span>=float,title:^(Select a File)(.*)$
<span style="color: #b8860b;">windowrule</span>=float,title:^(Choose wallpaper)(.*)$
<span style="color: #b8860b;">windowrule</span>=float,title:^(Open Folder)(.*)$
<span style="color: #b8860b;">windowrule</span>=float,title:^(Save As)(.*)$
<span style="color: #b8860b;">windowrule</span>=float,title:^(Library)(.*)$
<span style="color: #b8860b;">windowrule</span>=float,title:^(File Upload)(.*)$
</pre>
</div>
</div>
</div>

<div id="outline-container-org72460c8" class="outline-4">
<h4 id="org72460c8"><code>thunar</code></h4>
<div class="outline-text-4" id="text-org72460c8">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrule</span> = center, title:^(Open File)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(Rename.*)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(Select a File)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(Choose wallpaper)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(Open Folder)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(Save As)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(Library)(.*)$
<span style="color: #b8860b;">windowrule</span> = center, title:^(File Upload)(.*)$
<span style="color: #b8860b;">windowrulev2</span> = float, title:(Rename.*)
<span style="color: #b8860b;">windowrulev2</span> = float, title:(File Operation Progress)
<span style="color: #b8860b;">windowrulev2</span> = float, class:(thunar),title:(Confirm to replace files)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8500c40" class="outline-4">
<h4 id="org8500c40">no tearing</h4>
<div class="outline-text-4" id="text-org8500c40">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = noshadow,floating:0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf17748" class="outline-4">
<h4 id="orgdf17748"><code>htop</code></h4>
<div class="outline-text-4" id="text-orgdf17748">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(htop)
<span style="color: #b8860b;">windowrulev2</span> = size 100% 40%, class:(htop)
<span style="color: #b8860b;">windowrulev2</span> = move 0 40, class:(htop)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3596cd" class="outline-4">
<h4 id="orgb3596cd"><code>nmtui</code></h4>
<div class="outline-text-4" id="text-orgb3596cd">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(nmtui)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e842c9" class="outline-4">
<h4 id="org0e842c9"><code>vim</code></h4>
<div class="outline-text-4" id="text-org0e842c9">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(vim)
<span style="color: #b8860b;">windowrulev2</span> = maximize, class:(vim)
</pre>
</div>
</div>
</div>

<div id="outline-container-org890e8b2" class="outline-4">
<h4 id="org890e8b2"><code>Emacs</code> (in terminal mode)</h4>
<div class="outline-text-4" id="text-org890e8b2">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = maximize, class:(nw-emacs)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a07587" class="outline-4">
<h4 id="org4a07587"><code>showmethekey</code></h4>
<div class="outline-text-4" id="text-org4a07587">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(one.alynx.showmethekey), title:(Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = nofocus, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = opacity 0.4, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = center, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = float, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = pin, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = size 100% 10%, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
<span style="color: #b8860b;">windowrulev2</span> = move 0 90%, class:(showmethekey-gtk), title:(Floating Window - Show Me The Key)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f90370" class="outline-4">
<h4 id="org4f90370"><code>screenkey</code></h4>
<div class="outline-text-4" id="text-org4f90370">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, class:(screenkey)
</pre>
</div>
</div>
</div>
<div id="outline-container-org76ff07a" class="outline-4">
<h4 id="org76ff07a">steam</h4>
<div class="outline-text-4" id="text-org76ff07a">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = opacity 1, class:(steam) initialTitle:(.*)
<span style="color: #b8860b;">windowrulev2</span> = float, class:(steam) initialTitle:(.*)
<span style="color: #b8860b;">windowrule</span>=immediate,class:.*\.exe
<span style="color: #b8860b;">windowrulev2</span>=immediate,class:(steam_app)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org1c345a3"></a>Mount &amp; Blade Warband<br />
<div class="outline-text-5" id="text-org1c345a3">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = opacity 1, class:(mb_warband_linux) initialTitle:(mb_warband_linux)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd3fad37" class="outline-4">
<h4 id="orgd3fad37">conky</h4>
<div class="outline-text-4" id="text-orgd3fad37">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">windowrulev2 = noinitialfocus, class:(Conky)</span>
<span style="color: #b8860b;">windowrulev2</span> = nofocus, class:(Conky)
<span style="color: #b8860b;">windowrulev2</span> = pseudo, class:(Conky)
<span style="color: #b8860b;">windowrulev2</span> = pin, class:(Conky)
<span style="color: #b22222;"># </span><span style="color: #b22222;">windowrulev2 = suppressevent activate activatefocus, class:(Conky)</span>
<span style="color: #b8860b;">windowrulev2</span> = opacity 1 override 0.5, class:(Conky)
</pre>
</div>
</div>
</div>
<div id="outline-container-org49ebc12" class="outline-4">
<h4 id="org49ebc12">easyeffect</h4>
<div class="outline-text-4" id="text-org49ebc12">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">windowrulev2</span> = float, title:(Easy Effects)
<span style="color: #b8860b;">windowrulev2</span> = size 100% 60%, title:(Easy Effects)
</pre>
</div>
</div>
</div>
