index.org
*** layer
#+begin_src conf
  layerrule = xray 1, .*
  # layerrule = noanim, .*
  layerrule = noanim, walker
  layerrule = noanim, selection
  layerrule = noanim, overview
  layerrule = noanim, anyrun
  layerrule = noanim, indicator.*
  layerrule = noanim, osk
  layerrule = noanim, hyprpicker
  layerrule = blur, shell:*
  layerrule = ignorealpha 0.6, shell:*

  layerrule = noanim, noanim
  layerrule = blur, gtk-layer-shell
  layerrule = ignorezero, gtk-layer-shell
  layerrule = blur, launcher
  layerrule = ignorealpha 0.5, launcher
  layerrule = blur, notifications
  layerrule = ignorealpha 0.69, notifications

  layerrule = animation slide top, sideleft.*
  layerrule = animation slide top, sideright.*
  layerrule = blur, session

  layerrule = blur, bar
  layerrule = ignorealpha 0.6, bar
  layerrule = blur, corner.*
  layerrule = ignorealpha 0.6, corner.*
  layerrule = blur, dock
  layerrule = ignorealpha 0.6, dock
  layerrule = blur, indicator.*
  layerrule = ignorealpha 0.6, indicator.*
  layerrule = blur, overview
  layerrule = ignorealpha 0.6, overview
  layerrule = blur, cheatsheet
  layerrule = ignorealpha 0.6, cheatsheet
  layerrule = blur, sideright
  layerrule = ignorealpha 0.6, sideright
  layerrule = blur, sideleft
  layerrule = ignorealpha 0.6, sideleft
  layerrule = blur, indicator*
  layerrule = ignorealpha 0.6, indicator*
  layerrule = blur, osk
  layerrule = ignorealpha 0.6, osk
#+end_src
** =~/.config/hypr/hypr.d/workspaces.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/workspaces.conf :mkdirp t
:END:
*** Normal Workspaces
#+caption: hyprpaper workspaces
[[./assets/img/workspaces.mp4][file:./assets/img/workspaces.mp4]]

These workspaces are just standard workspaces, the way I set them is to have dedicated workspaces for each applications, such as web browsers, terminal emulators, etc.
#+begin_src conf
  workspace = 1, name:terminal
  workspace = 2, name:code
  workspace = 3, name:web
  workspace = 4, name:message
  workspace = 5, name:file
  workspace = 6, name:office
  workspace = 7, name:fun
  workspace = 8, name:remote
  workspace = 9, name:torrent
  workspace = 10, name:zoom
#+end_src
*** Special workspaces
In other window managers, a special workspace is often called /scratchpad/. The difference is in /Hyprland/ we can have up to 97 of them, each with different names. The way I use it is to have one special workspace for an application, usually one that needs to always run in the background, like a music player, calculator and other. What I like from /Hyprland/ (though I'm sure other /WM/ also have), is the ability to only start the application when the workspace is opened. See the keybindings section for the detail.

Also to conserve resource, I tend to only have terminal based application in these workspaces.
#+begin_src conf
  workspace = special:music, on-created-empty:[tiled] $terminal --class ncmpcpp -e ncmpcpp
  workspace = special:khal, on-created-empty:[tiled] $terminal --class khal -e khal interactive
  workspace = special:proc, on-created-empty:[tiled] $terminal --class htop -e htop
  workspace = special:emacs, on-created-empty:[tiled] $terminal --class emacsclient -e $editor_term
  #workspace = special:mail, on-created-empty:[tiled] thunderbird
  workspace = special:dired, on-created-empty:[tiled] $terminal --class emacsclient -e $editor_term -e '(dired (getenv "HOME"))'
  workspace = special:keys, on-created-empty:[float] showmethekey-gtk
  workspace = special:nvim, on-created-empty:$terminal --class vim -e nvim
#+end_src
** =~/.config/hypr/hypr.d/keybindings.conf=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/keybindings.conf :mkdirp t
:END:
*** Set the =mainMod= variable
~Super~, (or ~WIN~) key, is a more common mod key for window manager anyway.
#+begin_src conf
  # See https://wiki.hyprland.org/Configuring/Keywords/ for more
  $mainMod = SUPER
#+end_src

