index.html
<div id="outline-container-orga9a3640" class="outline-4">
<h4 id="orga9a3640">layer</h4>
<div class="outline-text-4" id="text-orga9a3640">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">layerrule</span> = xray 1, .*
<span style="color: #b22222;"># </span><span style="color: #b22222;">layerrule = noanim, .*</span>
<span style="color: #b8860b;">layerrule</span> = noanim, walker
<span style="color: #b8860b;">layerrule</span> = noanim, selection
<span style="color: #b8860b;">layerrule</span> = noanim, overview
<span style="color: #b8860b;">layerrule</span> = noanim, anyrun
<span style="color: #b8860b;">layerrule</span> = noanim, indicator.*
<span style="color: #b8860b;">layerrule</span> = noanim, osk
<span style="color: #b8860b;">layerrule</span> = noanim, hyprpicker
<span style="color: #b8860b;">layerrule</span> = blur, shell:*
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, shell:*

<span style="color: #b8860b;">layerrule</span> = noanim, noanim
<span style="color: #b8860b;">layerrule</span> = blur, gtk-layer-shell
<span style="color: #b8860b;">layerrule</span> = ignorezero, gtk-layer-shell
<span style="color: #b8860b;">layerrule</span> = blur, launcher
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.5, launcher
<span style="color: #b8860b;">layerrule</span> = blur, notifications
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.69, notifications

<span style="color: #b8860b;">layerrule</span> = animation slide top, sideleft.*
<span style="color: #b8860b;">layerrule</span> = animation slide top, sideright.*
<span style="color: #b8860b;">layerrule</span> = blur, session

<span style="color: #b8860b;">layerrule</span> = blur, bar
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, bar
<span style="color: #b8860b;">layerrule</span> = blur, corner.*
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, corner.*
<span style="color: #b8860b;">layerrule</span> = blur, dock
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, dock
<span style="color: #b8860b;">layerrule</span> = blur, indicator.*
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, indicator.*
<span style="color: #b8860b;">layerrule</span> = blur, overview
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, overview
<span style="color: #b8860b;">layerrule</span> = blur, cheatsheet
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, cheatsheet
<span style="color: #b8860b;">layerrule</span> = blur, sideright
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, sideright
<span style="color: #b8860b;">layerrule</span> = blur, sideleft
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, sideleft
<span style="color: #b8860b;">layerrule</span> = blur, indicator*
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, indicator*
<span style="color: #b8860b;">layerrule</span> = blur, osk
<span style="color: #b8860b;">layerrule</span> = ignorealpha 0.6, osk
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd41c934" class="outline-3">
<h3 id="orgd41c934"><code>~/.config/hypr/hypr.d/workspaces.conf</code></h3>
<div class="outline-text-3" id="text-orgd41c934">
</div>
<div id="outline-container-org93e3e40" class="outline-4">
<h4 id="org93e3e40">Normal Workspaces</h4>
<div class="outline-text-4" id="text-org93e3e40">
<p>
<a href="./assets/img/workspaces.mp4">file:./assets/img/workspaces.mp4</a>
</p>

<p>
These workspaces are just standard workspaces, the way I set them is to have dedicated workspaces for each applications, such as web browsers, terminal emulators, etc.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">workspace</span> = 1, name:terminal
<span style="color: #b8860b;">workspace</span> = 2, name:code
<span style="color: #b8860b;">workspace</span> = 3, name:web
<span style="color: #b8860b;">workspace</span> = 4, name:message
<span style="color: #b8860b;">workspace</span> = 5, name:file
<span style="color: #b8860b;">workspace</span> = 6, name:office
<span style="color: #b8860b;">workspace</span> = 7, name:fun
<span style="color: #b8860b;">workspace</span> = 8, name:remote
<span style="color: #b8860b;">workspace</span> = 9, name:torrent
<span style="color: #b8860b;">workspace</span> = 10, name:zoom
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb19d79c" class="outline-4">
<h4 id="orgb19d79c">Special workspaces</h4>
<div class="outline-text-4" id="text-orgb19d79c">
<p>
In other window managers, a special workspace is often called <i>scratchpad</i>. The difference is in <i>Hyprland</i> we can have up to 97 of them, each with different names. The way I use it is to have one special workspace for an application, usually one that needs to always run in the background, like a music player, calculator and other. What I like from <i>Hyprland</i> (though I'm sure other <i>WM</i> also have), is the ability to only start the application when the workspace is opened. See the keybindings section for the detail.
</p>

<p>
Also to conserve resource, I tend to only have terminal based application in these workspaces.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">workspace</span> = special:music, on-created-empty:[tiled] $terminal --class ncmpcpp -e ncmpcpp
<span style="color: #b8860b;">workspace</span> = special:khal, on-created-empty:[tiled] $terminal --class khal -e khal interactive
<span style="color: #b8860b;">workspace</span> = special:proc, on-created-empty:[tiled] $terminal --class htop -e htop
<span style="color: #b8860b;">workspace</span> = special:emacs, on-created-empty:[tiled] $terminal --class emacsclient -e $editor_term
<span style="color: #b22222;">#</span><span style="color: #b22222;">workspace = special:mail, on-created-empty:[tiled] thunderbird</span>
<span style="color: #b8860b;">workspace</span> = special:dired, on-created-empty:[tiled] $terminal --class emacsclient -e $editor_term -e <span style="color: #bc8f8f;">'(dired (getenv "HOME"))'</span>
<span style="color: #b8860b;">workspace</span> = special:keys, on-created-empty:[float] showmethekey-gtk
<span style="color: #b8860b;">workspace</span> = special:nvim, on-created-empty:$terminal --class vim -e nvim
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2fd0697" class="outline-3">
<h3 id="org2fd0697"><code>~/.config/hypr/hypr.d/keybindings.conf</code></h3>
<div class="outline-text-3" id="text-org2fd0697">
</div>
<div id="outline-container-orge2a10d5" class="outline-4">
<h4 id="orge2a10d5">Set the <code>mainMod</code> variable</h4>
<div class="outline-text-4" id="text-orge2a10d5">
<p>
<code>Super</code>, (or <code>WIN</code>) key, is a more common mod key for window manager anyway.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">See https://wiki.hyprland.org/Configuring/Keywords/ for more</span>
<span style="color: #b8860b;">$mainMod</span> = SUPER
</pre>
</div>
</div>
</div>
