index.org
*** Apps keybindings
#+begin_src conf
  # Example binds, see https://wiki.hyprland.org/Configuring/Binds/ for more
  bind = $mainMod, Return, exec, $terminal
  bind = $mainMod, E, exec, $fileManager
  bind = $mainMod, F4, exec, hyprctl kill
  bind = ALT, F4, killactive,
  bind = $mainMod, Q, exec, ~/.local/bin/rofi-logout hyprland-logout
  bind = $mainMod Alt, Q, exec, hyprlock
  bind = $mainMod, D, exec, $menu
  bind = $mainMod, C, exec, cliphist list | rofi -dmenu -p "Clipboard:" -theme "hyprland-clipboard" | cliphist decode | wl-copy
  bind = $mainMod, Comma, exec, rofi -theme hyprland-emoji -show emoji
  bind = $mainMod Shift, V, exec, pwvucontrol
  bind = $mainMod Alt, V, exec, easyeffects
  #bind = $mainMod Alt, B, exec, blueman-manager

  bind = $mainMod Alt, M, exec, [workspace special:music; silent; tiled] alacritty --class ncmpcpp -e ncmpcpp
  # bind = $mainMod Alt, H, exec, alacritty --class htop -e htop
  # bind = $mainMod Alt, W, exec, [float] alacritty --class nmtui -e nmtui
  # bind = $mainMod Alt, K, exec, alacritty --class khal -e khal interactive
  # bind = $mainMod Alt, V, exec, alacritty --class vim -e vim
  # bind = $mainMod Shift Alt, N, exec, alacritty --class nw-emacs -e emacsclient -t -a emacs
  # bind = $mainMod Alt, E, exec, emacsclient -c -a emacs -e '(dired (getenv "HOME"))'
  bind = $mainMod Alt, N, exec, $editor
  bind = $mainMod Alt, T, exec, $mail
  bind = $mainMod Alt, P, exec, rofi-pass
  bind = $mainMod Alt, C, exec, rofi -show calc -modi calc -no-show-match -no-sort
  bind = $mainMod Shift, P, exec, rofi-rbw
  bind = $mainMod Alt, f, exec, $browser
  bind = $mainMod Alt, S, exec, [workspace 10; silent; float] showmethekey-gtk
  bind = $mainMod Alt, A, exec, hyprshade toggle

  # tesseract
  bind = SuperShift,T,exec,grim -g "$(slurp -d -c D1E5F4BB -b 1B232866 -s 00000000)" "tmp.png" && tesseract -l eng "tmp.png" - | wl-copy && rm "tmp.png"

  # restart waybar
  bind = $mainMod Shift, R, exec, killall waybar && waybar &
#+end_src

*** window
#+begin_src conf
  bind = $mainMod, F, fullscreen, 0
  bind = $mainMod Shift, F, fullscreen, 1
  bind = $mainMod Control, F, fullscreenstate, -1 -1
  bind = $mainMod, Space, togglefloating,

  # Move focus with mainMod + arrow keys
  bind = $mainMod, left, movefocus, l
  bind = $mainMod, right, movefocus, r
  bind = $mainMod, up, movefocus, u
  bind = $mainMod, down, movefocus, d

  bind = $mainMod, H, movefocus, l
  bind = $mainMod, L, movefocus, r
  bind = $mainMod, K, movefocus, u
  bind = $mainMod, J, movefocus, d

  # resize
  binde = $mainMod Control, H, resizeactive, -10 0
  binde = $mainMod Control, J, resizeactive, 0 10
  binde = $mainMod Control, K, resizeactive, 0 -10
  binde = $mainMod Control, L, resizeactive, 10 0

  binde = $mainMod Control, left, resizeactive, -10 0
  binde = $mainMod Control, down, resizeactive, 0 10
  binde = $mainMod Control, up, resizeactive, 0 -10
  binde = $mainMod Control, right, resizeactive, 10 0

  # move window
  bind = $mainMod Shift, H, movewindow, l
  bind = $mainMod Shift, J, movewindow, d
  bind = $mainMod Shift, K, movewindow, u
  bind = $mainMod Shift, L, movewindow, r

  # Window split ratio
  binde = Super, Minus, splitratio, -0.1
  binde = Super, Equal, splitratio, 0.1
  binde = Super, Semicolon, splitratio, -0.1
  binde = Super, Apostrophe, splitratio, 0.1
#+end_src

*** Mouse
#+begin_src conf
  # Move/resize windows with mainMod + LMB/RMB and dragging
  bindm = $mainMod, mouse:272, movewindow
  bindm = $mainMod, mouse:273, resizewindow
#+end_src
