index.html

<div id="outline-container-org902d045" class="outline-4">
<h4 id="org902d045">Apps keybindings</h4>
<div class="outline-text-4" id="text-org902d045">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">Example binds, see https://wiki.hyprland.org/Configuring/Binds/ for more</span>
<span style="color: #b8860b;">bind</span> = $mainMod, Return, exec, $terminal
<span style="color: #b8860b;">bind</span> = $mainMod, E, exec, $fileManager
<span style="color: #b8860b;">bind</span> = $mainMod, F4, exec, hyprctl kill
<span style="color: #b8860b;">bind</span> = ALT, F4, killactive,
<span style="color: #b8860b;">bind</span> = $mainMod, Q, exec, ~/.local/bin/rofi-logout hyprland-logout
<span style="color: #b8860b;">bind</span> = $mainMod Alt, Q, exec, hyprlock
<span style="color: #b8860b;">bind</span> = $mainMod, D, exec, $menu
<span style="color: #b8860b;">bind</span> = $mainMod, C, exec, cliphist list | rofi -dmenu -p <span style="color: #bc8f8f;">"Clipboard:"</span> -theme <span style="color: #bc8f8f;">"hyprland-clipboard"</span> | cliphist decode | wl-copy
<span style="color: #b8860b;">bind</span> = $mainMod, Comma, exec, rofi -theme hyprland-emoji -show emoji
<span style="color: #b8860b;">bind</span> = $mainMod Shift, V, exec, pwvucontrol
<span style="color: #b8860b;">bind</span> = $mainMod Alt, V, exec, easyeffects
<span style="color: #b22222;">#</span><span style="color: #b22222;">bind = $mainMod Alt, B, exec, blueman-manager</span>

<span style="color: #b8860b;">bind</span> = $mainMod Alt, M, exec, [workspace special:music; silent; tiled] alacritty --class ncmpcpp -e ncmpcpp
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, H, exec, alacritty --class htop -e htop</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, W, exec, [float] alacritty --class nmtui -e nmtui</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, K, exec, alacritty --class khal -e khal interactive</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, V, exec, alacritty --class vim -e vim</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Shift Alt, N, exec, alacritty --class nw-emacs -e emacsclient -t -a emacs</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, E, exec, emacsclient -c -a emacs -e '(dired (getenv "HOME"))'</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, N, exec, $editor
<span style="color: #b8860b;">bind</span> = $mainMod Alt, T, exec, $mail
<span style="color: #b8860b;">bind</span> = $mainMod Alt, P, exec, rofi-pass
<span style="color: #b8860b;">bind</span> = $mainMod Alt, C, exec, rofi -show calc -modi calc -no-show-match -no-sort
<span style="color: #b8860b;">bind</span> = $mainMod Shift, P, exec, rofi-rbw
<span style="color: #b8860b;">bind</span> = $mainMod Alt, f, exec, $browser
<span style="color: #b8860b;">bind</span> = $mainMod Alt, S, exec, [workspace 10; silent; float] showmethekey-gtk
<span style="color: #b8860b;">bind</span> = $mainMod Alt, A, exec, hyprshade toggle

<span style="color: #b22222;"># </span><span style="color: #b22222;">tesseract</span>
<span style="color: #b8860b;">bind</span> = SuperShift,T,exec,grim -g <span style="color: #bc8f8f;">"$(slurp -d -c D1E5F4BB -b 1B232866 -s 00000000)"</span> <span style="color: #bc8f8f;">"tmp.png"</span> &amp;&amp; tesseract -l eng <span style="color: #bc8f8f;">"tmp.png"</span> - | wl-copy &amp;&amp; rm <span style="color: #bc8f8f;">"tmp.png"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">restart waybar</span>
<span style="color: #b8860b;">bind</span> = $mainMod Shift, R, exec, killall waybar &amp;&amp; waybar &amp;
</pre>
</div>
</div>
</div>

<div id="outline-container-org721ae09" class="outline-4">
<h4 id="org721ae09">window</h4>
<div class="outline-text-4" id="text-org721ae09">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">bind</span> = $mainMod, F, fullscreen, 0
<span style="color: #b8860b;">bind</span> = $mainMod Shift, F, fullscreen, 1
<span style="color: #b8860b;">bind</span> = $mainMod Control, F, fullscreenstate, -1 -1
<span style="color: #b8860b;">bind</span> = $mainMod, Space, togglefloating,

<span style="color: #b22222;"># </span><span style="color: #b22222;">Move focus with mainMod + arrow keys</span>
<span style="color: #b8860b;">bind</span> = $mainMod, left, movefocus, l
<span style="color: #b8860b;">bind</span> = $mainMod, right, movefocus, r
<span style="color: #b8860b;">bind</span> = $mainMod, up, movefocus, u
<span style="color: #b8860b;">bind</span> = $mainMod, down, movefocus, d

<span style="color: #b8860b;">bind</span> = $mainMod, H, movefocus, l
<span style="color: #b8860b;">bind</span> = $mainMod, L, movefocus, r
<span style="color: #b8860b;">bind</span> = $mainMod, K, movefocus, u
<span style="color: #b8860b;">bind</span> = $mainMod, J, movefocus, d

<span style="color: #b22222;"># </span><span style="color: #b22222;">resize</span>
<span style="color: #b8860b;">binde</span> = $mainMod Control, H, resizeactive, -10 0
<span style="color: #b8860b;">binde</span> = $mainMod Control, J, resizeactive, 0 10
<span style="color: #b8860b;">binde</span> = $mainMod Control, K, resizeactive, 0 -10
<span style="color: #b8860b;">binde</span> = $mainMod Control, L, resizeactive, 10 0

<span style="color: #b8860b;">binde</span> = $mainMod Control, left, resizeactive, -10 0
<span style="color: #b8860b;">binde</span> = $mainMod Control, down, resizeactive, 0 10
<span style="color: #b8860b;">binde</span> = $mainMod Control, up, resizeactive, 0 -10
<span style="color: #b8860b;">binde</span> = $mainMod Control, right, resizeactive, 10 0

<span style="color: #b22222;"># </span><span style="color: #b22222;">move window</span>
<span style="color: #b8860b;">bind</span> = $mainMod Shift, H, movewindow, l
<span style="color: #b8860b;">bind</span> = $mainMod Shift, J, movewindow, d
<span style="color: #b8860b;">bind</span> = $mainMod Shift, K, movewindow, u
<span style="color: #b8860b;">bind</span> = $mainMod Shift, L, movewindow, r

<span style="color: #b22222;"># </span><span style="color: #b22222;">Window split ratio</span>
<span style="color: #b8860b;">binde</span> = Super, Minus, splitratio, -0.1
<span style="color: #b8860b;">binde</span> = Super, Equal, splitratio, 0.1
<span style="color: #b8860b;">binde</span> = Super, Semicolon, splitratio, -0.1
<span style="color: #b8860b;">binde</span> = Super, Apostrophe, splitratio, 0.1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd24f863" class="outline-4">
<h4 id="orgd24f863">Mouse</h4>
<div class="outline-text-4" id="text-orgd24f863">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">Move/resize windows with mainMod + LMB/RMB and dragging</span>
<span style="color: #b8860b;">bindm</span> = $mainMod, mouse:272, movewindow
<span style="color: #b8860b;">bindm</span> = $mainMod, mouse:273, resizewindow
</pre>
</div>
</div>
</div>
