index.org
*** Media keys
#+begin_src conf
  binde = , XF86AudioRaiseVolume, exec, ~/.local/bin/dunst-volume -i 1
  # binde = , XF86AudioLowerVolume, exec, pactl set-sink-volume @DEFAULT_SINK@ -1%
  binde = , XF86AudioLowerVolume, exec, ~/.local/bin/dunst-volume -d 1
  bindl = , XF86AudioMute, exec, ~/.local/bin/dunst-volume -t
  # bindl = , XF86AudioMicMute, exec, pactl set-source-mute @DEFAULT_SOURCE@ toggle

  bind = , XF86AudioPlay, exec, playerctl play-pause
  bind = , XF86AudioNext, exec, playerctl next
  bind = , XF86AudioPrev, exec, playerctl previous

  # for keyboard with no fn keys
  binde = $mainMod, F9, exec, ~/.local/bin/dunst-volume -i 1 # volume up
  binde = $mainMod, F8, exec, ~/.local/bin/dunst-volume -d 1 # volume down
  bind = $mainMod, F7, exec, ~/.local/bin/dunst-volume -t # volume toggle
  binde = $mainMod Shift, F3, exec, ~/.local/bin/dunst-backlight +1% # brightness increase
  bind = $mainMod Shift, F2, exec, ~/.local/bin/dunst-backlight 1%- # brightness decrease
  bind = $mainMod Control, Up, exec, playerctl play-pause
  binde = $mainMod, F11, exec, playerctl play-pause
  bind = $mainMod Control, Down, exec, playerctl stop
  binde = $mainMod Control, Right, exec, playerctl next
  binde = $mainMod, F12, exec, playerctl next
  binde = $mainMod Control, Left, exec, playerctl previous
  binde = $mainMod, F10, exec, playerctl previous

  # binde = , XF86MonBrightnessUp, exec, brightnessctl set +1%
  binde = , XF86MonBrightnessUp, exec, ~/.local/bin/dunst-backlight +1%
  binde = , XF86MonBrightnessDown, exec, ~/.local/bin/dunst-backlight 1%-
  # binde = , XF86MonBrightnessDown, exec, brightnessctl set 1%-

  bind = , Print, exec, grim "$(echo ~/Pictures/Screenshots/Screenshot1-$(date +'%Y%m%d_%H%M%S').png)"
  bind = Control, Print, exec, grim -g "$(slurp)" - | swappy -f -
  bind = Alt, Print, exec, ~/.local/bin/screen-record

  bind = $mainMod Shift, S, exec, grim -g "$(slurp)" - | swappy -f -
#+end_src
*** =dunst=
#+begin_src conf
  bind = $mainMod Alt, grave, exec, dunstctl history-pop
  bind = $mainMod SHIFT, grave, exec, dunstctl context
  bind = $mainMod, grave, exec, dunstctl action
  bind = $mainMod Control, grave, exec, dunstctl close
#+end_src
*** Groups 
**** Group management
#+begin_src conf
  bind = $mainMod, bracketleft, changegroupactive, b
  bind = $mainMod, bracketright, changegroupactive, f

  bind = $mainMod, T, togglegroup

  bind = $mainMod, G, submap, group
  submap = group
  bind = , T, togglegroup
  bind = $mainMod Control, F, changegroupactive, f
  bind = $mainMod Control, B, changegroupactive, b

  bind = $mainMod, bracketleft, changegroupactive, b
  bind = $mainMod, bracketright, changegroupactive, f
  # bind = $mainMod Alt, L, lockactivegroup
  bind = $mainMod, G, lockgroups, toggle
  bind = $mainMod Alt, G, lockactivegroup, toggle

  bind = $mainMod Shift, left, moveintogroup, l
  bind = $mainMod Shift, right, moveintogroup, r
  bind = $mainMod Shift, up, moveintogroup, u
  bind = $mainMod Shift, down, moveintogroup, d

  bind = $mainMod Shift, H, moveintogroup, l
  bind = $mainMod Shift, L, moveintogroup, r
  bind = $mainMod Shift, K, moveintogroup, u
  bind = $mainMod Shift, J, moveintogroup, d

  bind = $mainMod Control, left, moveoutofgroup, l
  bind = $mainMod Control, right, moveoutofgroup, r
  bind = $mainMod Control, up, moveoutofgroup, u
  bind = $mainMod Control, down, moveoutofgroup, d

  bind = $mainMod Control, H, moveoutofgroup, l
  bind = $mainMod Control, L, moveoutofgroup, r
  bind = $mainMod Control, K, moveoutofgroup, u
  bind = $mainMod Control, J, moveoutofgroup, d

  bind = $mainMod, left, movefocus, l
  bind = $mainMod, right, movefocus, r
  bind = $mainMod, up, movefocus, u
  bind = $mainMod, down, movefocus, d

  bind = $mainMod, H, movefocus, l
  bind = $mainMod, L, movefocus, r
  bind = $mainMod, K, movefocus, u
  bind = $mainMod, J, movefocus, d

  bind = , escape, submap, reset
  bind = Control, G, submap, reset
  submap = reset

  bind = $mainMod Control, F, changegroupactive, f
  bind = $mainMod Control, B, changegroupactive, b
#+end_src
**** Window Resize
#+begin_src conf
  # Resize
  bind = $mainMod, R, submap, resize
  submap = resize
  # using arrow key
  binde = , right, resizeactive, 10 0
  binde = , left, resizeactive, -10 0
  binde = , up, resizeactive, 0 -10
  binde = , down, resizeactive, 0 10
  # using vim key
  binde = , l, resizeactive, 10 0
  binde = , h, resizeactive, -10 0
  binde = , k, resizeactive, 0 -10
  binde = , j, resizeactive, 0 10
  bind = Control, G, submap, reset
  bind = , escape, submap, reset
  submap = reset
#+end_src
*** Hyprland 
#+begin_src conf
  bind = $mainMod, P, pseudo, # dwindle
  bind = $mainMod, S, togglesplit, # dwindle
  bind = Alt Control Shift, Tab, layoutmsg, swapprev
#+end_src
