index.html
<div id="outline-container-org9721925" class="outline-4">
<h4 id="org9721925">Media keys</h4>
<div class="outline-text-4" id="text-org9721925">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">binde</span> = , XF86AudioRaiseVolume, exec, ~/.local/bin/dunst-volume -i 1
<span style="color: #b22222;"># </span><span style="color: #b22222;">binde = , XF86AudioLowerVolume, exec, pactl set-sink-volume @DEFAULT_SINK@ -1%</span>
<span style="color: #b8860b;">binde</span> = , XF86AudioLowerVolume, exec, ~/.local/bin/dunst-volume -d 1
<span style="color: #b8860b;">bindl</span> = , XF86AudioMute, exec, ~/.local/bin/dunst-volume -t
<span style="color: #b22222;"># </span><span style="color: #b22222;">bindl = , XF86AudioMicMute, exec, pactl set-source-mute @DEFAULT_SOURCE@ toggle</span>

<span style="color: #b8860b;">bind</span> = , XF86AudioPlay, exec, playerctl play-pause
<span style="color: #b8860b;">bind</span> = , XF86AudioNext, exec, playerctl next
<span style="color: #b8860b;">bind</span> = , XF86AudioPrev, exec, playerctl previous

<span style="color: #b22222;"># </span><span style="color: #b22222;">for keyboard with no fn keys</span>
<span style="color: #b8860b;">binde</span> = $mainMod, F9, exec, ~/.local/bin/dunst-volume -i 1 <span style="color: #b22222;"># </span><span style="color: #b22222;">volume up</span>
<span style="color: #b8860b;">binde</span> = $mainMod, F8, exec, ~/.local/bin/dunst-volume -d 1 <span style="color: #b22222;"># </span><span style="color: #b22222;">volume down</span>
<span style="color: #b8860b;">bind</span> = $mainMod, F7, exec, ~/.local/bin/dunst-volume -t <span style="color: #b22222;"># </span><span style="color: #b22222;">volume toggle</span>
<span style="color: #b8860b;">binde</span> = $mainMod Shift, F3, exec, ~/.local/bin/dunst-backlight +1% <span style="color: #b22222;"># </span><span style="color: #b22222;">brightness increase</span>
<span style="color: #b8860b;">bind</span> = $mainMod Shift, F2, exec, ~/.local/bin/dunst-backlight 1%- <span style="color: #b22222;"># </span><span style="color: #b22222;">brightness decrease</span>
<span style="color: #b8860b;">bind</span> = $mainMod Control, Up, exec, playerctl play-pause
<span style="color: #b8860b;">binde</span> = $mainMod, F11, exec, playerctl play-pause
<span style="color: #b8860b;">bind</span> = $mainMod Control, Down, exec, playerctl stop
<span style="color: #b8860b;">binde</span> = $mainMod Control, Right, exec, playerctl next
<span style="color: #b8860b;">binde</span> = $mainMod, F12, exec, playerctl next
<span style="color: #b8860b;">binde</span> = $mainMod Control, Left, exec, playerctl previous
<span style="color: #b8860b;">binde</span> = $mainMod, F10, exec, playerctl previous

<span style="color: #b22222;"># </span><span style="color: #b22222;">binde = , XF86MonBrightnessUp, exec, brightnessctl set +1%</span>
<span style="color: #b8860b;">binde</span> = , XF86MonBrightnessUp, exec, ~/.local/bin/dunst-backlight +1%
<span style="color: #b8860b;">binde</span> = , XF86MonBrightnessDown, exec, ~/.local/bin/dunst-backlight 1%-
<span style="color: #b22222;"># </span><span style="color: #b22222;">binde = , XF86MonBrightnessDown, exec, brightnessctl set 1%-</span>

<span style="color: #b8860b;">bind</span> = , Print, exec, grim <span style="color: #bc8f8f;">"$(echo ~/Pictures/Screenshots/Screenshot1-$(date +'%Y%m%d_%H%M%S').png)"</span>
<span style="color: #b8860b;">bind</span> = Control, Print, exec, grim -g <span style="color: #bc8f8f;">"$(slurp)"</span> - | swappy -f -
<span style="color: #b8860b;">bind</span> = Alt, Print, exec, ~/.local/bin/screen-record

<span style="color: #b8860b;">bind</span> = $mainMod Shift, S, exec, grim -g <span style="color: #bc8f8f;">"$(slurp)"</span> - | swappy -f -
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c5d779" class="outline-4">
<h4 id="org0c5d779"><code>dunst</code></h4>
<div class="outline-text-4" id="text-org0c5d779">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">bind</span> = $mainMod Alt, grave, exec, dunstctl history-pop
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, grave, exec, dunstctl context
<span style="color: #b8860b;">bind</span> = $mainMod, grave, exec, dunstctl action
<span style="color: #b8860b;">bind</span> = $mainMod Control, grave, exec, dunstctl close
</pre>
</div>
</div>
</div>
<div id="outline-container-org74e7828" class="outline-4">
<h4 id="org74e7828">Groups</h4>
<div class="outline-text-4" id="text-org74e7828">
</div>
<ul class="org-ul">
<li><a id="org1c71562"></a>Group management<br />
<div class="outline-text-5" id="text-org1c71562">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">bind</span> = $mainMod, bracketleft, changegroupactive, b
<span style="color: #b8860b;">bind</span> = $mainMod, bracketright, changegroupactive, f

<span style="color: #b8860b;">bind</span> = $mainMod, T, togglegroup

<span style="color: #b8860b;">bind</span> = $mainMod, G, submap, group
<span style="color: #b8860b;">submap</span> = group
<span style="color: #b8860b;">bind</span> = , T, togglegroup
<span style="color: #b8860b;">bind</span> = $mainMod Control, F, changegroupactive, f
<span style="color: #b8860b;">bind</span> = $mainMod Control, B, changegroupactive, b

<span style="color: #b8860b;">bind</span> = $mainMod, bracketleft, changegroupactive, b
<span style="color: #b8860b;">bind</span> = $mainMod, bracketright, changegroupactive, f
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, L, lockactivegroup</span>
<span style="color: #b8860b;">bind</span> = $mainMod, G, lockgroups, toggle
<span style="color: #b8860b;">bind</span> = $mainMod Alt, G, lockactivegroup, toggle

<span style="color: #b8860b;">bind</span> = $mainMod Shift, left, moveintogroup, l
<span style="color: #b8860b;">bind</span> = $mainMod Shift, right, moveintogroup, r
<span style="color: #b8860b;">bind</span> = $mainMod Shift, up, moveintogroup, u
<span style="color: #b8860b;">bind</span> = $mainMod Shift, down, moveintogroup, d

<span style="color: #b8860b;">bind</span> = $mainMod Shift, H, moveintogroup, l
<span style="color: #b8860b;">bind</span> = $mainMod Shift, L, moveintogroup, r
<span style="color: #b8860b;">bind</span> = $mainMod Shift, K, moveintogroup, u
<span style="color: #b8860b;">bind</span> = $mainMod Shift, J, moveintogroup, d

<span style="color: #b8860b;">bind</span> = $mainMod Control, left, moveoutofgroup, l
<span style="color: #b8860b;">bind</span> = $mainMod Control, right, moveoutofgroup, r
<span style="color: #b8860b;">bind</span> = $mainMod Control, up, moveoutofgroup, u
<span style="color: #b8860b;">bind</span> = $mainMod Control, down, moveoutofgroup, d

<span style="color: #b8860b;">bind</span> = $mainMod Control, H, moveoutofgroup, l
<span style="color: #b8860b;">bind</span> = $mainMod Control, L, moveoutofgroup, r
<span style="color: #b8860b;">bind</span> = $mainMod Control, K, moveoutofgroup, u
<span style="color: #b8860b;">bind</span> = $mainMod Control, J, moveoutofgroup, d

<span style="color: #b8860b;">bind</span> = $mainMod, left, movefocus, l
<span style="color: #b8860b;">bind</span> = $mainMod, right, movefocus, r
<span style="color: #b8860b;">bind</span> = $mainMod, up, movefocus, u
<span style="color: #b8860b;">bind</span> = $mainMod, down, movefocus, d

<span style="color: #b8860b;">bind</span> = $mainMod, H, movefocus, l
<span style="color: #b8860b;">bind</span> = $mainMod, L, movefocus, r
<span style="color: #b8860b;">bind</span> = $mainMod, K, movefocus, u
<span style="color: #b8860b;">bind</span> = $mainMod, J, movefocus, d

<span style="color: #b8860b;">bind</span> = , escape, submap, reset
<span style="color: #b8860b;">bind</span> = Control, G, submap, reset
<span style="color: #b8860b;">submap</span> = reset

<span style="color: #b8860b;">bind</span> = $mainMod Control, F, changegroupactive, f
<span style="color: #b8860b;">bind</span> = $mainMod Control, B, changegroupactive, b
</pre>
</div>
</div>
</li>
<li><a id="orgbb75360"></a>Window Resize<br />
<div class="outline-text-5" id="text-orgbb75360">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">Resize</span>
<span style="color: #b8860b;">bind</span> = $mainMod, R, submap, resize
<span style="color: #b8860b;">submap</span> = resize
<span style="color: #b22222;"># </span><span style="color: #b22222;">using arrow key</span>
<span style="color: #b8860b;">binde</span> = , right, resizeactive, 10 0
<span style="color: #b8860b;">binde</span> = , left, resizeactive, -10 0
<span style="color: #b8860b;">binde</span> = , up, resizeactive, 0 -10
<span style="color: #b8860b;">binde</span> = , down, resizeactive, 0 10
<span style="color: #b22222;"># </span><span style="color: #b22222;">using vim key</span>
<span style="color: #b8860b;">binde</span> = , l, resizeactive, 10 0
<span style="color: #b8860b;">binde</span> = , h, resizeactive, -10 0
<span style="color: #b8860b;">binde</span> = , k, resizeactive, 0 -10
<span style="color: #b8860b;">binde</span> = , j, resizeactive, 0 10
<span style="color: #b8860b;">bind</span> = Control, G, submap, reset
<span style="color: #b8860b;">bind</span> = , escape, submap, reset
<span style="color: #b8860b;">submap</span> = reset
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgeef04ef" class="outline-4">
<h4 id="orgeef04ef">Hyprland</h4>
<div class="outline-text-4" id="text-orgeef04ef">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">bind</span> = $mainMod, P, pseudo, <span style="color: #b22222;"># </span><span style="color: #b22222;">dwindle</span>
<span style="color: #b8860b;">bind</span> = $mainMod, S, togglesplit, <span style="color: #b22222;"># </span><span style="color: #b22222;">dwindle</span>
<span style="color: #b8860b;">bind</span> = Alt Control Shift, Tab, layoutmsg, swapprev
</pre>
</div>
</div>
<ul class="org-ul">
