index.org
**** Master layout
#+begin_src conf
  # master
  bind = $mainMod Alt, TAB, layoutmsg, swapwithmaster auto
  bind = $mainMod Alt, H, layoutmsg, orientationleft
  bind = $mainMod Alt, J, layoutmsg, orientationbottom
  bind = $mainMod Alt, K, layoutmsg, orientationtop
  bind = $mainMod Alt, L, layoutmsg, orientationright
  bind = Alt Shift, Tab, layoutmsg, swapnext
  bind = Alt, Tab, cyclenext
  bind = Alt Control, TAB, layoutmsg, cycleprev
#+end_src
*** Workspaces
#+begin_src conf
  # Switch workspaces with mainMod + [0-9]
  bind = $mainMod, 1, workspace, 1
  bind = $mainMod, 1, exec, $w1
  bind = $mainMod, 2, workspace, 2
  bind = $mainMod, 2, exec, $w2
  bind = $mainMod, 3, workspace, 3
  bind = $mainMod, 3, exec, $w3
  bind = $mainMod, 4, workspace, 4
  bind = $mainMod, 4, exec, $w4
  bind = $mainMod, 5, workspace, 5
  bind = $mainMod, 5, exec, $w5
  bind = $mainMod, 6, workspace, 6
  bind = $mainMod, 6, exec, $w6
  bind = $mainMod, 7, workspace, 7
  bind = $mainMod, 7, exec, $w7
  bind = $mainMod, 8, workspace, 8
  bind = $mainMod, 8, exec, $w8
  bind = $mainMod, 9, workspace, 9
  bind = $mainMod, 9, exec, $w9
  bind = $mainMod, 0, workspace, 10
  bind = $mainMod, 0, exec, $w10
  bind = $mainMod, TAB, workspace, previous
#+end_src
I set the bindings for workspace to have multiple bindings, the first one is to move to the intended workspace, but also to set the wallpaper to the variable set at the /variables.conf/ file.
**** Workspace movement
#+begin_src conf
  # Move active window to a workspace with mainMod + SHIFT + [0-9]
  bind = $mainMod SHIFT, 1, movetoworkspace, 1
  bind = $mainMod SHIFT, 2, movetoworkspace, 2
  bind = $mainMod SHIFT, 3, movetoworkspace, 3
  bind = $mainMod SHIFT, 4, movetoworkspace, 4
  bind = $mainMod SHIFT, 5, movetoworkspace, 5
  bind = $mainMod SHIFT, 6, movetoworkspace, 6
  bind = $mainMod SHIFT, 7, movetoworkspace, 7
  bind = $mainMod SHIFT, 8, movetoworkspace, 8
  bind = $mainMod SHIFT, 9, movetoworkspace, 9
  bind = $mainMod SHIFT, 0, movetoworkspace, 10
  bind = $mainMod SHIFT, TAB, movetoworkspace, previous

  bind = $mainMod Alt, H, focusmonitor, l
  bind = $mainMod Alt, J, focusmonitor, d
  bind = $mainMod Alt, K, focusmonitor, u
  bind = $mainMod Alt, L, focusmonitor, r

  bind = $mainMod Control, H, movecurrentworkspacetomonitor, l
  bind = $mainMod Control, J, movecurrentworkspacetomonitor, d
  bind = $mainMod Control, K, movecurrentworkspacetomonitor, u
  bind = $mainMod Control, L, movecurrentworkspacetomonitor, r

  # bind = $mainMod, O, toggleopaque

  bind = Alt, Tab, alterzorder, top
  bind = Alt Shift, Tab, bringactivetotop,
  bind = Alt Control, TAB, bringactivetotop,
  bind = Alt Control Shift, Tab, bringactivetotop,
#+end_src
**** Laptops
#+begin_src conf
  # lid switch
  # trigger when the switch is toggled
  bindl=,switch:Lid Switch,exec,hyprlock
  # trigger when the switch is turning on
  #bindl=,switch:on:[switch name],exec,hyprctl keyword monitor ", 2560x1600, 0x0, 1"
  # trigger when the switch is turning off
  #bindl=,switch:off:[switch name],exec,hyprctl keyword monitor ", disable"
#+end_src
**** special workspace
#+begin_src conf
  # 0 is fn+m (music) in my laptop
  bind = $mainMod Alt, 0, togglespecialworkspace, music
  # 1 is for htop
  bind = $mainMod Alt, 1, togglespecialworkspace, proc
  # 2 is fn+k (khal)
  bind = $mainMod Alt, 2, togglespecialworkspace, khal
  # 3 is for terminal emacsclient
  bind = $mainMod Alt, 3, togglespecialworkspace, emacs
  # 4 is for terminal notmuch (using emacsclient)
  #bind = $mainMod Alt, 4, togglespecialworkspace, mail
  # 5 is for dired
  bind = $mainMod Alt, 5, togglespecialworkspace, dired
  # 6 is for nvim
  bind = $mainMod Alt, 6, togglespecialworkspace, nvim
  # 7 is for org-agenda (emacsclient)
  # bind = $mainMod Alt, 7, togglespecialworkspace, agenda
  # 0 is for showmethekey-gtk
  bind = $mainMod Alt, 9, togglespecialworkspace, keys
#+end_src
**** mouse
#+begin_src conf

  # Scroll through existing workspaces with mainMod + scroll
  bind = $mainMod, mouse_down, workspace, e+1
  bind = $mainMod, mouse_up, workspace, e-1
#+end_src
** =~~/.config/hypr/hypr.d/xwayland.conf~=
:PROPERTIES:
:header-args: :tangle .config/hypr/hypr.d/xwayland.conf :mkdirp t
:END:

#+begin_src conf
  xwayland {
    enabled = true
  }
#+end_src
* waybar
** =~/.config/waybar/config=
:PROPERTIES:
:header-args: :tangle .config/waybar/config :mkdirp t
:END:
*** start config
#+begin_src js
  {
#+end_src
