index.html
<li><a id="org11fc1f3"></a>Master layout<br />
<div class="outline-text-5" id="text-org11fc1f3">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">master</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, TAB, layoutmsg, swapwithmaster auto
<span style="color: #b8860b;">bind</span> = $mainMod Alt, H, layoutmsg, orientationleft
<span style="color: #b8860b;">bind</span> = $mainMod Alt, J, layoutmsg, orientationbottom
<span style="color: #b8860b;">bind</span> = $mainMod Alt, K, layoutmsg, orientationtop
<span style="color: #b8860b;">bind</span> = $mainMod Alt, L, layoutmsg, orientationright
<span style="color: #b8860b;">bind</span> = Alt Shift, Tab, layoutmsg, swapnext
<span style="color: #b8860b;">bind</span> = Alt, Tab, cyclenext
<span style="color: #b8860b;">bind</span> = Alt Control, TAB, layoutmsg, cycleprev
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcf0bfb2" class="outline-4">
<h4 id="orgcf0bfb2">Workspaces</h4>
<div class="outline-text-4" id="text-orgcf0bfb2">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">Switch workspaces with mainMod + [0-9]</span>
<span style="color: #b8860b;">bind</span> = $mainMod, 1, workspace, 1
<span style="color: #b8860b;">bind</span> = $mainMod, 1, exec, $w1
<span style="color: #b8860b;">bind</span> = $mainMod, 2, workspace, 2
<span style="color: #b8860b;">bind</span> = $mainMod, 2, exec, $w2
<span style="color: #b8860b;">bind</span> = $mainMod, 3, workspace, 3
<span style="color: #b8860b;">bind</span> = $mainMod, 3, exec, $w3
<span style="color: #b8860b;">bind</span> = $mainMod, 4, workspace, 4
<span style="color: #b8860b;">bind</span> = $mainMod, 4, exec, $w4
<span style="color: #b8860b;">bind</span> = $mainMod, 5, workspace, 5
<span style="color: #b8860b;">bind</span> = $mainMod, 5, exec, $w5
<span style="color: #b8860b;">bind</span> = $mainMod, 6, workspace, 6
<span style="color: #b8860b;">bind</span> = $mainMod, 6, exec, $w6
<span style="color: #b8860b;">bind</span> = $mainMod, 7, workspace, 7
<span style="color: #b8860b;">bind</span> = $mainMod, 7, exec, $w7
<span style="color: #b8860b;">bind</span> = $mainMod, 8, workspace, 8
<span style="color: #b8860b;">bind</span> = $mainMod, 8, exec, $w8
<span style="color: #b8860b;">bind</span> = $mainMod, 9, workspace, 9
<span style="color: #b8860b;">bind</span> = $mainMod, 9, exec, $w9
<span style="color: #b8860b;">bind</span> = $mainMod, 0, workspace, 10
<span style="color: #b8860b;">bind</span> = $mainMod, 0, exec, $w10
<span style="color: #b8860b;">bind</span> = $mainMod, TAB, workspace, previous
</pre>
</div>
<p>
I set the bindings for workspace to have multiple bindings, the first one is to move to the intended workspace, but also to set the wallpaper to the variable set at the <i>variables.conf</i> file.
</p>
</div>
<ul class="org-ul">
<li><a id="org37c5309"></a>Workspace movement<br />
<div class="outline-text-5" id="text-org37c5309">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">Move active window to a workspace with mainMod + SHIFT + [0-9]</span>
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 1, movetoworkspace, 1
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 2, movetoworkspace, 2
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 3, movetoworkspace, 3
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 4, movetoworkspace, 4
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 5, movetoworkspace, 5
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 6, movetoworkspace, 6
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 7, movetoworkspace, 7
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 8, movetoworkspace, 8
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 9, movetoworkspace, 9
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, 0, movetoworkspace, 10
<span style="color: #b8860b;">bind</span> = $mainMod SHIFT, TAB, movetoworkspace, previous

<span style="color: #b8860b;">bind</span> = $mainMod Alt, H, focusmonitor, l
<span style="color: #b8860b;">bind</span> = $mainMod Alt, J, focusmonitor, d
<span style="color: #b8860b;">bind</span> = $mainMod Alt, K, focusmonitor, u
<span style="color: #b8860b;">bind</span> = $mainMod Alt, L, focusmonitor, r

<span style="color: #b8860b;">bind</span> = $mainMod Control, H, movecurrentworkspacetomonitor, l
<span style="color: #b8860b;">bind</span> = $mainMod Control, J, movecurrentworkspacetomonitor, d
<span style="color: #b8860b;">bind</span> = $mainMod Control, K, movecurrentworkspacetomonitor, u
<span style="color: #b8860b;">bind</span> = $mainMod Control, L, movecurrentworkspacetomonitor, r

<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod, O, toggleopaque</span>

<span style="color: #b8860b;">bind</span> = Alt, Tab, alterzorder, top
<span style="color: #b8860b;">bind</span> = Alt Shift, Tab, bringactivetotop,
<span style="color: #b8860b;">bind</span> = Alt Control, TAB, bringactivetotop,
<span style="color: #b8860b;">bind</span> = Alt Control Shift, Tab, bringactivetotop,
</pre>
</div>
</div>
</li>
<li><a id="org5ef12b7"></a>Laptops<br />
<div class="outline-text-5" id="text-org5ef12b7">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">lid switch</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">trigger when the switch is toggled</span>
<span style="color: #b8860b;">bindl</span>=,switch:Lid Switch,exec,hyprlock
<span style="color: #b22222;"># </span><span style="color: #b22222;">trigger when the switch is turning on</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">bindl=,switch:on:[switch name],exec,hyprctl keyword monitor ", 2560x1600, 0x0, 1"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">trigger when the switch is turning off</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">bindl=,switch:off:[switch name],exec,hyprctl keyword monitor ", disable"</span>
</pre>
</div>
</div>
</li>
<li><a id="org75ab4d3"></a>special workspace<br />
<div class="outline-text-5" id="text-org75ab4d3">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">0 is fn+m (music) in my laptop</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 0, togglespecialworkspace, music
<span style="color: #b22222;"># </span><span style="color: #b22222;">1 is for htop</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 1, togglespecialworkspace, proc
<span style="color: #b22222;"># </span><span style="color: #b22222;">2 is fn+k (khal)</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 2, togglespecialworkspace, khal
<span style="color: #b22222;"># </span><span style="color: #b22222;">3 is for terminal emacsclient</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 3, togglespecialworkspace, emacs
<span style="color: #b22222;"># </span><span style="color: #b22222;">4 is for terminal notmuch (using emacsclient)</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">bind = $mainMod Alt, 4, togglespecialworkspace, mail</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">5 is for dired</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 5, togglespecialworkspace, dired
<span style="color: #b22222;"># </span><span style="color: #b22222;">6 is for nvim</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 6, togglespecialworkspace, nvim
<span style="color: #b22222;"># </span><span style="color: #b22222;">7 is for org-agenda (emacsclient)</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bind = $mainMod Alt, 7, togglespecialworkspace, agenda</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">0 is for showmethekey-gtk</span>
<span style="color: #b8860b;">bind</span> = $mainMod Alt, 9, togglespecialworkspace, keys
</pre>
</div>
</div>
</li>
<li><a id="org783fd4b"></a>mouse<br />
<div class="outline-text-5" id="text-org783fd4b">
<div class="org-src-container">
<pre class="src src-conf">
<span style="color: #b22222;"># </span><span style="color: #b22222;">Scroll through existing workspaces with mainMod + scroll</span>
<span style="color: #b8860b;">bind</span> = $mainMod, mouse_down, workspace, e+1
<span style="color: #b8860b;">bind</span> = $mainMod, mouse_up, workspace, e-1
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7ee026a" class="outline-3">
<h3 id="org7ee026a"><code>~~/.config/hypr/hypr.d/xwayland.conf~</code></h3>
<div class="outline-text-3" id="text-org7ee026a">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #228b22;">xwayland</span> {
  <span style="color: #b8860b;">enabled</span> = true
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1a4c0ee" class="outline-2">
<h2 id="org1a4c0ee">waybar</h2>
<div class="outline-text-2" id="text-org1a4c0ee">
</div>
<div id="outline-container-orga06f33b" class="outline-3">
<h3 id="orga06f33b"><code>~/.config/waybar/config</code></h3>
<div class="outline-text-3" id="text-orga06f33b">
</div>
