index.org
*** General
#+begin_src js

  "layer": "top", // Waybar at top layer
  "output": ["eDP-1", "DP-1", "DP-2", "DP-3", "DP-4", "DP-5", "HDMI-A-1"],
  "position": "top", // Waybar position (top|bottom|left|right)
  "height": 34, // Waybar height (to be removed for auto height)
  // "width": 1280, // Waybar width
  "spacing": 4, // Gaps between modules (4px)
  // Choose the order of the modules
#+end_src
*** Left Modules
#+begin_src js
  "modules-left": [
    "custom/launcher",
    "hyprland/workspaces",
    "hyprland/submap"
    // "mpris"
    // "custom/media"
  ],
#+end_src
*** Center Modules
#+begin_src js
  "modules-center": [
    "hyprland/window"
  ],
#+end_src
*** Right Modules
#+begin_src js
  "modules-right": [
    // "mpd",
    // "idle_inhibitor",
    "backlight",
    "pulseaudio",
    // "wireplumber",
    "network",
    "cpu",
    "memory",
    "temperature",
    "keyboard-state",
    // "hyprland/language",
    "battery",
    "custom/pacman",
    "clock#date",
    "clock#time",
    "tray",
    "custom/power"
  ],
#+end_src
*** Modules Configuration 
**** mpris
#+begin_src js
  "mpris": {
    "format": "{player_icon} {title}",
    "format-paused": "{status_icon} <i>{title}</i>",
    "player-icons": {
      "default": "▶",
      "mpv": "🎵"
    },
    "status-icons": {
      "paused": "⏸"
    },
  },
#+end_src
**** backlight
#+begin_src js
  "backlight": {
    "format": " {percent}%",
    "interval": 2,
    "on-scroll-up": "brightnessctl set +1%",
    "on-scroll-down": "brightnessctl set 1%-"
  },
#+end_src
**** hyprland/workspaces
#+begin_src js
  "hyprland/workspaces": {
    "num-tags": 6,
    // "format": "{id}: {icon}",
    // "format-icons": {
    //   "1": "",
    //   "2": "",
    //   "3": "󰖟",
    //   "4": "󰺻",
    //   "5": "󰈔",
    //   "6": "󰦑",
    //   "7": "",
    //   "8": "󰑔",
    //   "9": "",
    //   "10": ""
    // },
    "active-only": false
  },
#+end_src
**** hyprland/languages
#+begin_src js
  "hyprland/language": {
    "format": "{}",
    "format-en": "en",
    "keyboard-name": "at-translated-set-2-keyboard"
  },
#+end_src
**** hyprland/window
#+begin_src js
  "hyprland/window": {
    "format": "{title}",
    "rewrite": {
      "(.*) — Mozilla Firefox": "🌎 $1",
      "(.*) - (GNU Emacs at.*)": "$1"
    },
    "max-length": 80,
    "separate-outputs": true
  },
#+end_src
**** hyprland/submap
#+begin_src js
  "hyprland/submap": {
    "format": "{}",
    "max-length": 8,
    "tooltip": false
  },
#+end_src
**** keyboard-state
#+begin_src js
  "keyboard-state": {
    "numlock": false,
    "capslock": true,
    "format": "{name} {icon}",
    "format-icons": {
      "locked": "",
      "unlocked": ""
    }
  },
#+end_src
