index.html
<div id="outline-container-orgfefdd4d" class="outline-4">
<h4 id="orgfefdd4d">start config</h4>
<div class="outline-text-4" id="text-orgfefdd4d">
<div class="org-src-container">
<pre class="src src-js">{
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde45809" class="outline-4">
<h4 id="orgde45809">General</h4>
<div class="outline-text-4" id="text-orgde45809">
<div class="org-src-container">
<pre class="src src-js">
<span style="color: #bc8f8f;">"layer"</span>: <span style="color: #bc8f8f;">"top"</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">Waybar at top layer</span>
<span style="color: #bc8f8f;">"output"</span>: [<span style="color: #bc8f8f;">"eDP-1"</span>, <span style="color: #bc8f8f;">"DP-1"</span>, <span style="color: #bc8f8f;">"DP-2"</span>, <span style="color: #bc8f8f;">"DP-3"</span>, <span style="color: #bc8f8f;">"DP-4"</span>, <span style="color: #bc8f8f;">"DP-5"</span>, <span style="color: #bc8f8f;">"HDMI-A-1"</span>],
<span style="color: #bc8f8f;">"position"</span>: <span style="color: #bc8f8f;">"top"</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">Waybar position (top|bottom|left|right)</span>
<span style="color: #bc8f8f;">"height"</span>: 34, <span style="color: #b22222;">// </span><span style="color: #b22222;">Waybar height (to be removed for auto height)</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">"width": 1280, // Waybar width</span>
<span style="color: #bc8f8f;">"spacing"</span>: 4, <span style="color: #b22222;">// </span><span style="color: #b22222;">Gaps between modules (4px)</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Choose the order of the modules</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4161a19" class="outline-4">
<h4 id="org4161a19">Left Modules</h4>
<div class="outline-text-4" id="text-org4161a19">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"modules-left"</span>: [
  <span style="color: #bc8f8f;">"custom/launcher"</span>,
  <span style="color: #bc8f8f;">"hyprland/workspaces"</span>,
  <span style="color: #bc8f8f;">"hyprland/submap"</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"mpris"</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"custom/media"</span>
],
</pre>
</div>
</div>
</div>
<div id="outline-container-org969fec6" class="outline-4">
<h4 id="org969fec6">Center Modules</h4>
<div class="outline-text-4" id="text-org969fec6">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"modules-center"</span>: [
  <span style="color: #bc8f8f;">"hyprland/window"</span>
],
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a02249" class="outline-4">
<h4 id="org9a02249">Right Modules</h4>
<div class="outline-text-4" id="text-org9a02249">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"modules-right"</span>: [
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"mpd",</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"idle_inhibitor",</span>
  <span style="color: #bc8f8f;">"backlight"</span>,
  <span style="color: #bc8f8f;">"pulseaudio"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"wireplumber",</span>
  <span style="color: #bc8f8f;">"network"</span>,
  <span style="color: #bc8f8f;">"cpu"</span>,
  <span style="color: #bc8f8f;">"memory"</span>,
  <span style="color: #bc8f8f;">"temperature"</span>,
  <span style="color: #bc8f8f;">"keyboard-state"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"hyprland/language",</span>
  <span style="color: #bc8f8f;">"battery"</span>,
  <span style="color: #bc8f8f;">"custom/pacman"</span>,
  <span style="color: #bc8f8f;">"clock#date"</span>,
  <span style="color: #bc8f8f;">"clock#time"</span>,
  <span style="color: #bc8f8f;">"tray"</span>,
  <span style="color: #bc8f8f;">"custom/power"</span>
],
</pre>
</div>
</div>
</div>
<div id="outline-container-org8352829" class="outline-4">
<h4 id="org8352829">Modules Configuration</h4>
<div class="outline-text-4" id="text-org8352829">
</div>
<ul class="org-ul">
<li><a id="orgeb48f1d"></a>mpris<br />
<div class="outline-text-5" id="text-orgeb48f1d">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"mpris"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{player_icon} {title}"</span>,
  <span style="color: #bc8f8f;">"format-paused"</span>: <span style="color: #bc8f8f;">"{status_icon} &lt;i&gt;{title}&lt;/i&gt;"</span>,
  <span style="color: #bc8f8f;">"player-icons"</span>: {
    <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"&#9654;"</span>,
    <span style="color: #bc8f8f;">"mpv"</span>: <span style="color: #bc8f8f;">"&#127925;"</span>
  },
  <span style="color: #bc8f8f;">"status-icons"</span>: {
    <span style="color: #bc8f8f;">"paused"</span>: <span style="color: #bc8f8f;">"&#9208;"</span>
  },
},
</pre>
</div>
</div>
</li>
<li><a id="org85532dd"></a>backlight<br />
<div class="outline-text-5" id="text-org85532dd">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"backlight"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#61829; {percent}%"</span>,
  <span style="color: #bc8f8f;">"interval"</span>: 2,
  <span style="color: #bc8f8f;">"on-scroll-up"</span>: <span style="color: #bc8f8f;">"brightnessctl set +1%"</span>,
  <span style="color: #bc8f8f;">"on-scroll-down"</span>: <span style="color: #bc8f8f;">"brightnessctl set 1%-"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="orgb681037"></a>hyprland/workspaces<br />
<div class="outline-text-5" id="text-orgb681037">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/workspaces"</span>: {
  <span style="color: #bc8f8f;">"num-tags"</span>: 6,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format": "{id}: {icon}",</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format-icons": {</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"1": "&#59285;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"2": "&#60100;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"3": "&#984479;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"4": "&#986811;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"5": "&#983572;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"6": "&#985489;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"7": "&#61723;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"8": "&#984148;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"9": "&#61786;",</span>
  <span style="color: #b22222;">//   </span><span style="color: #b22222;">"10": "&#62770;"</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">},</span>
  <span style="color: #bc8f8f;">"active-only"</span>: <span style="color: #5f9ea0;">false</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org2a4e68f"></a>hyprland/languages<br />
<div class="outline-text-5" id="text-org2a4e68f">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/language"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{}"</span>,
  <span style="color: #bc8f8f;">"format-en"</span>: <span style="color: #bc8f8f;">"en"</span>,
  <span style="color: #bc8f8f;">"keyboard-name"</span>: <span style="color: #bc8f8f;">"at-translated-set-2-keyboard"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="orgd582104"></a>hyprland/window<br />
<div class="outline-text-5" id="text-orgd582104">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/window"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{title}"</span>,
  <span style="color: #bc8f8f;">"rewrite"</span>: {
    <span style="color: #bc8f8f;">"(.*) &#8212; Mozilla Firefox"</span>: <span style="color: #bc8f8f;">"&#127758; $1"</span>,
    <span style="color: #bc8f8f;">"(.*) - (GNU Emacs at.*)"</span>: <span style="color: #bc8f8f;">"$1"</span>
  },
  <span style="color: #bc8f8f;">"max-length"</span>: 80,
  <span style="color: #bc8f8f;">"separate-outputs"</span>: <span style="color: #5f9ea0;">true</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org2e0e674"></a>hyprland/submap<br />
<div class="outline-text-5" id="text-org2e0e674">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"hyprland/submap"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{}"</span>,
  <span style="color: #bc8f8f;">"max-length"</span>: 8,
  <span style="color: #bc8f8f;">"tooltip"</span>: <span style="color: #5f9ea0;">false</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org277e03d"></a>keyboard-state<br />
<div class="outline-text-5" id="text-org277e03d">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"keyboard-state"</span>: {
  <span style="color: #bc8f8f;">"numlock"</span>: <span style="color: #5f9ea0;">false</span>,
  <span style="color: #bc8f8f;">"capslock"</span>: <span style="color: #5f9ea0;">true</span>,
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{name} {icon}"</span>,
  <span style="color: #bc8f8f;">"format-icons"</span>: {
    <span style="color: #bc8f8f;">"locked"</span>: <span style="color: #bc8f8f;">"&#61475;"</span>,
    <span style="color: #bc8f8f;">"unlocked"</span>: <span style="color: #bc8f8f;">"&#61596;"</span>
  }
},
</pre>
</div>
</div>
</li>
