index.org
**** mpd
#+begin_src js
  "mpd": {
    // "format": "{stateIcon} {consumeIcon}{randomIcon}{repeatIcon}{singleIcon}{artist} - {album} - {title} ({elapsedTime:%M:%S}/{totalTime:%M:%S}) ⸨{songPosition}|{queueLength}⸩ {volume}% ",
    "format": "  {title} - {artist} {stateIcon} [{elapsedTime:%M:%S}/{totalTime:%M:%S}] {consumeIcon}{randomIcon}{repeatIcon}{singleIcon}[{songPosition}/{queueLength}] [{volume}%]",
    "format-disconnected": "Disconnected ",
    "format-stopped": "{consumeIcon}{randomIcon}{repeatIcon}{singleIcon}Stopped ",
    "unknown-tag": "N/A",
    "interval": 2,
    "consume-icons": {
      "on": " "
    },
    "random-icons": {
      "off": "<span color=\"#f53c3c\"></span> ",
      "on": " "
    },
    "repeat-icons": {
      "on": " "
    },
    "single-icons": {
      "on": "1 "
    },
    "state-icons": {
      "paused": "",
      "playing": ""
    },
    "tooltip-format": "MPD (connected)",
    "tooltip-format-disconnected": "MPD (disconnected)"
  },
#+end_src
**** idle_inhibitor
#+begin_src js
  "idle_inhibitor": {
    "format": "{icon}",
    "format-icons": {
      "activated": "",
      "deactivated": ""
    }
  },
#+end_src
**** tray
#+begin_src js
  "tray": {
    // "icon-size": 21,
    "spacing": 10
  },
#+end_src
**** clock
#+begin_src js
  "clock#date": {
    // "timezone": "America/New_York",
    "format": " {:%Y/%m/%d(%a)}",
    "on-click": "alacritty --class khal -e khal interactive",
    "tooltip-format": "<big>{:%Y %B}</big>\n<tt><small>{calendar}</small></tt>"
    // "format-alt": "{:%Y-%m-%d}"
  },
  "clock#time": {
    "interval": 1,
    "format": "{:%H:%M:%S}",
    "tooltip": false
  },
#+end_src
**** cpu
#+begin_src js
  "cpu": {
    "format": "{usage}% ",
    // "format": " {}%",
    "tooltip": true,
    "interval": 15
  },
#+end_src
**** memory
#+begin_src js
  "memory": {
    "interval": 30,
    "format": "{}% "
    // "max-length": 50
  },
#+end_src
**** temperature
#+begin_src js
  "temperature": {
    // "thermal-zone": 2,
    // "hwmon-path": "/sys/class/hwmon/hwmon2/temp1_input",
    "critical-threshold": 80,
    // "format-critical": "{temperatureC}°C {icon}",
    "format": "{temperatureC}°C {icon}",
    "format-icons": ["", "", ""]
  },
#+end_src
**** battery
#+begin_src js
  "battery": {
    "states": {
      // "good": 95,
      "warning": 30,
      "critical": 15
    },
    "format": " {icon} {capacity}%",
    "format-charging": " {capacity}%",
    "format-plugged": " {capacity}%",
    "format-alt": "{icon} {time}",
    // "format-good": "", // An empty format will hide the module
    // "format-full": "",
    "format-icons": ["", "", "", "", ""]
  },
  "battery#bat2": {
    "bat": "BAT2"
  },
#+end_src
**** network
#+begin_src js
  "network": {
    // "interface": "wlp2*", // (Optional) To force the use of this interface
    "format": "{ifname}",
    "format-wifi": "{essid} ({signalStrength}%) ",
    "format-ethernet": "{ipaddr}/{cidr} ",
    "tooltip-format": "{ifname} via {gwaddr} ",
    "format-linked": "{ifname} (No IP) ",
    "format-disconnected": "Disconnected ⚠",
    "format-alt": "{ifname}: {ipaddr}/{cidr} ({bandwidthUpBits} - {bandwidthDownBits})"
  },
#+end_src
**** wireplumber
#+begin_src js
  "wireplumber": {
    "format": "{icon} {volume}%",
    "format-icons": ["󰕿", "󰖀", "󰕾"],
    "format-muted": "",
    "on-click": "helvum",
    "on-click-right": "pavucontrol",
    "scroll-step": 0.2
  },
#+end_src
