index.html
<li><a id="org24f99d5"></a>mpd<br />
<div class="outline-text-5" id="text-org24f99d5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"mpd"</span>: {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format": "{stateIcon} {consumeIcon}{randomIcon}{repeatIcon}{singleIcon}{artist} - {album} - {title} ({elapsedTime:%M:%S}/{totalTime:%M:%S}) &#11816;{songPosition}|{queueLength}&#11817; {volume}% &#61441;",</span>
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#61441;  {title} - {artist} {stateIcon} [{elapsedTime:%M:%S}/{totalTime:%M:%S}] {consumeIcon}{randomIcon}{repeatIcon}{singleIcon}[{songPosition}/{queueLength}] [{volume}%]"</span>,
  <span style="color: #bc8f8f;">"format-disconnected"</span>: <span style="color: #bc8f8f;">"Disconnected &#61441;"</span>,
  <span style="color: #bc8f8f;">"format-stopped"</span>: <span style="color: #bc8f8f;">"{consumeIcon}{randomIcon}{repeatIcon}{singleIcon}Stopped &#61441;"</span>,
  <span style="color: #bc8f8f;">"unknown-tag"</span>: <span style="color: #bc8f8f;">"N/A"</span>,
  <span style="color: #bc8f8f;">"interval"</span>: 2,
  <span style="color: #bc8f8f;">"consume-icons"</span>: {
    <span style="color: #bc8f8f;">"on"</span>: <span style="color: #bc8f8f;">"&#61636; "</span>
  },
  <span style="color: #bc8f8f;">"random-icons"</span>: {
    <span style="color: #bc8f8f;">"off"</span>: <span style="color: #bc8f8f;">"&lt;span color=\"#f53c3c\"&gt;&#61556;&lt;/span&gt; "</span>,
    <span style="color: #bc8f8f;">"on"</span>: <span style="color: #bc8f8f;">"&#61556; "</span>
  },
  <span style="color: #bc8f8f;">"repeat-icons"</span>: {
    <span style="color: #bc8f8f;">"on"</span>: <span style="color: #bc8f8f;">"&#61470; "</span>
  },
  <span style="color: #bc8f8f;">"single-icons"</span>: {
    <span style="color: #bc8f8f;">"on"</span>: <span style="color: #bc8f8f;">"&#61470;1 "</span>
  },
  <span style="color: #bc8f8f;">"state-icons"</span>: {
    <span style="color: #bc8f8f;">"paused"</span>: <span style="color: #bc8f8f;">"&#61516;"</span>,
    <span style="color: #bc8f8f;">"playing"</span>: <span style="color: #bc8f8f;">"&#61515;"</span>
  },
  <span style="color: #bc8f8f;">"tooltip-format"</span>: <span style="color: #bc8f8f;">"MPD (connected)"</span>,
  <span style="color: #bc8f8f;">"tooltip-format-disconnected"</span>: <span style="color: #bc8f8f;">"MPD (disconnected)"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="orge69c173"></a>idle_inhibitor<br />
<div class="outline-text-5" id="text-orge69c173">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"idle_inhibitor"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{icon}"</span>,
  <span style="color: #bc8f8f;">"format-icons"</span>: {
    <span style="color: #bc8f8f;">"activated"</span>: <span style="color: #bc8f8f;">"&#61550;"</span>,
    <span style="color: #bc8f8f;">"deactivated"</span>: <span style="color: #bc8f8f;">"&#61552;"</span>
  }
},
</pre>
</div>
</div>
</li>
<li><a id="org1db4ed9"></a>tray<br />
<div class="outline-text-5" id="text-org1db4ed9">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"tray"</span>: {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"icon-size": 21,</span>
  <span style="color: #bc8f8f;">"spacing"</span>: 10
},
</pre>
</div>
</div>
</li>
<li><a id="org91ca660"></a>clock<br />
<div class="outline-text-5" id="text-org91ca660">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"clock#date"</span>: {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"timezone": "America/New_York",</span>
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#61555; {:%Y/%m/%d(%a)}"</span>,
  <span style="color: #bc8f8f;">"on-click"</span>: <span style="color: #bc8f8f;">"alacritty --class khal -e khal interactive"</span>,
  <span style="color: #bc8f8f;">"tooltip-format"</span>: <span style="color: #bc8f8f;">"&lt;big&gt;{:%Y %B}&lt;/big&gt;\n&lt;tt&gt;&lt;small&gt;{calendar}&lt;/small&gt;&lt;/tt&gt;"</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format-alt": "{:%Y-%m-%d}"</span>
},
<span style="color: #bc8f8f;">"clock#time"</span>: {
  <span style="color: #bc8f8f;">"interval"</span>: 1,
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{:%H:%M:%S}"</span>,
  <span style="color: #bc8f8f;">"tooltip"</span>: <span style="color: #5f9ea0;">false</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org7103647"></a>cpu<br />
<div class="outline-text-5" id="text-org7103647">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"cpu"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{usage}% &#62171;"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format": "&#62171; {}%",</span>
  <span style="color: #bc8f8f;">"tooltip"</span>: <span style="color: #5f9ea0;">true</span>,
  <span style="color: #bc8f8f;">"interval"</span>: 15
},
</pre>
</div>
</div>
</li>
<li><a id="orgb746712"></a>memory<br />
<div class="outline-text-5" id="text-orgb746712">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"memory"</span>: {
  <span style="color: #bc8f8f;">"interval"</span>: 30,
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{}% &#61641;"</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"max-length": 50</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org74e5913"></a>temperature<br />
<div class="outline-text-5" id="text-org74e5913">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"temperature"</span>: {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"thermal-zone": 2,</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"hwmon-path": "/sys/class/hwmon/hwmon2/temp1_input",</span>
  <span style="color: #bc8f8f;">"critical-threshold"</span>: 80,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format-critical": "{temperatureC}&#176;C {icon}",</span>
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{temperatureC}&#176;C {icon}"</span>,
  <span style="color: #bc8f8f;">"format-icons"</span>: [<span style="color: #bc8f8f;">"&#63339;"</span>, <span style="color: #bc8f8f;">"&#62153;"</span>, <span style="color: #bc8f8f;">"&#63337;"</span>]
},
</pre>
</div>
</div>
</li>
<li><a id="org49d9d74"></a>battery<br />
<div class="outline-text-5" id="text-org49d9d74">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"battery"</span>: {
  <span style="color: #bc8f8f;">"states"</span>: {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">"good": 95,</span>
    <span style="color: #bc8f8f;">"warning"</span>: 30,
    <span style="color: #bc8f8f;">"critical"</span>: 15
  },
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">" {icon} {capacity}%"</span>,
  <span style="color: #bc8f8f;">"format-charging"</span>: <span style="color: #bc8f8f;">"&#62951; {capacity}%"</span>,
  <span style="color: #bc8f8f;">"format-plugged"</span>: <span style="color: #bc8f8f;">"&#61926; {capacity}%"</span>,
  <span style="color: #bc8f8f;">"format-alt"</span>: <span style="color: #bc8f8f;">"{icon} {time}"</span>,
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format-good": "", // An empty format will hide the module</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"format-full": "",</span>
  <span style="color: #bc8f8f;">"format-icons"</span>: [<span style="color: #bc8f8f;">"&#62020;"</span>, <span style="color: #bc8f8f;">"&#62019;"</span>, <span style="color: #bc8f8f;">"&#62018;"</span>, <span style="color: #bc8f8f;">"&#62017;"</span>, <span style="color: #bc8f8f;">"&#62016;"</span>]
},
<span style="color: #bc8f8f;">"battery#bat2"</span>: {
  <span style="color: #bc8f8f;">"bat"</span>: <span style="color: #bc8f8f;">"BAT2"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="orgcce30f1"></a>network<br />
<div class="outline-text-5" id="text-orgcce30f1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"network"</span>: {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"interface": "wlp2*", // (Optional) To force the use of this interface</span>
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{ifname}"</span>,
  <span style="color: #bc8f8f;">"format-wifi"</span>: <span style="color: #bc8f8f;">"{essid} ({signalStrength}%) &#61931;"</span>,
  <span style="color: #bc8f8f;">"format-ethernet"</span>: <span style="color: #bc8f8f;">"{ipaddr}/{cidr} &#63382;"</span>,
  <span style="color: #bc8f8f;">"tooltip-format"</span>: <span style="color: #bc8f8f;">"{ifname} via {gwaddr} &#63382;"</span>,
  <span style="color: #bc8f8f;">"format-linked"</span>: <span style="color: #bc8f8f;">"{ifname} (No IP) &#63382;"</span>,
  <span style="color: #bc8f8f;">"format-disconnected"</span>: <span style="color: #bc8f8f;">"Disconnected &#9888;"</span>,
  <span style="color: #bc8f8f;">"format-alt"</span>: <span style="color: #bc8f8f;">"{ifname}: {ipaddr}/{cidr} ({bandwidthUpBits} - {bandwidthDownBits})"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org7f44fff"></a>wireplumber<br />
<div class="outline-text-5" id="text-org7f44fff">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"wireplumber"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{icon} {volume}%"</span>,
  <span style="color: #bc8f8f;">"format-icons"</span>: [<span style="color: #bc8f8f;">"&#984447;"</span>, <span style="color: #bc8f8f;">"&#984448;"</span>, <span style="color: #bc8f8f;">"&#984446;"</span>],
  <span style="color: #bc8f8f;">"format-muted"</span>: <span style="color: #bc8f8f;">"&#63145;"</span>,
  <span style="color: #bc8f8f;">"on-click"</span>: <span style="color: #bc8f8f;">"helvum"</span>,
  <span style="color: #bc8f8f;">"on-click-right"</span>: <span style="color: #bc8f8f;">"pavucontrol"</span>,
  <span style="color: #bc8f8f;">"scroll-step"</span>: 0.2
},
</pre>
</div>
</div>
</li>
