index.html
<li><a id="orge662114"></a>pulseaudio<br />
<div class="outline-text-5" id="text-orge662114">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"pulseaudio"</span>: {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"scroll-step": 1, // %, can be a float</span>
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{volume}% {icon} {format_source}"</span>,
  <span style="color: #bc8f8f;">"format-bluetooth"</span>: <span style="color: #bc8f8f;">"{volume}% {icon}&#62100; {format_source}"</span>,
  <span style="color: #bc8f8f;">"format-bluetooth-muted"</span>: <span style="color: #bc8f8f;">"&#63145; {icon}&#62100; {format_source}"</span>,
  <span style="color: #bc8f8f;">"format-muted"</span>: <span style="color: #bc8f8f;">"&#63145; {format_source}"</span>,
  <span style="color: #bc8f8f;">"format-source"</span>: <span style="color: #bc8f8f;">"{volume}% &#61744;"</span>,
  <span style="color: #bc8f8f;">"format-source-muted"</span>: <span style="color: #bc8f8f;">"&#61745;"</span>,
  <span style="color: #bc8f8f;">"format-icons"</span>: {
    <span style="color: #bc8f8f;">"headphone"</span>: <span style="color: #bc8f8f;">"&#61477;"</span>,
    <span style="color: #bc8f8f;">"hands-free"</span>: <span style="color: #bc8f8f;">"&#62864;"</span>,
    <span style="color: #bc8f8f;">"headset"</span>: <span style="color: #bc8f8f;">"&#62864;"</span>,
    <span style="color: #bc8f8f;">"phone"</span>: <span style="color: #bc8f8f;">"&#61589;"</span>,
    <span style="color: #bc8f8f;">"portable"</span>: <span style="color: #bc8f8f;">"&#61589;"</span>,
    <span style="color: #bc8f8f;">"car"</span>: <span style="color: #bc8f8f;">"&#61881;"</span>,
    <span style="color: #bc8f8f;">"default"</span>: [<span style="color: #bc8f8f;">"&#61478;"</span>, <span style="color: #bc8f8f;">"&#61479;"</span>, <span style="color: #bc8f8f;">"&#61480;"</span>]
  },
  <span style="color: #bc8f8f;">"on-click"</span>: <span style="color: #bc8f8f;">"wpctl set-mute @DEFAULT_AUDIO_SINK@ toggle"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org98769b0"></a>custom/pacman<br />
<div class="outline-text-5" id="text-org98769b0">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"custom/pacman"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#61538; {} update available"</span>,
  <span style="color: #bc8f8f;">"exec"</span>: <span style="color: #bc8f8f;">"checkupdates | wc -l"</span>,
  <span style="color: #bc8f8f;">"exec-if"</span>: <span style="color: #bc8f8f;">"test $(checkupdates | wc -l) -ne 0"</span>,
  <span style="color: #bc8f8f;">"interval"</span>: 3600,
  <span style="color: #bc8f8f;">"on-click"</span>: <span style="color: #bc8f8f;">"checkupdates; pkill -SIGRTMIN+8 waybar"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org0ca7c1f"></a>custom/launcher<br />
<div class="outline-text-5" id="text-org0ca7c1f">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"custom/launcher"</span>:{
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#62211; "</span>,
  <span style="color: #bc8f8f;">"tooltip"</span>: <span style="color: #5f9ea0;">false</span>,
  <span style="color: #bc8f8f;">"on-click"</span>: <span style="color: #bc8f8f;">"rofi -show drun -theme hyprland-menu"</span>,
  <span style="color: #bc8f8f;">"on-click-right"</span>: <span style="color: #bc8f8f;">"killall rofi"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org88ffde5"></a>custom/power<br />
<div class="outline-text-5" id="text-org88ffde5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"custom/power"</span>:{
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"&#61752; "</span>,
  <span style="color: #bc8f8f;">"tooltip"</span>: <span style="color: #5f9ea0;">false</span>,
  <span style="color: #bc8f8f;">"on-click"</span>: <span style="color: #bc8f8f;">"~/.local/bin/rofi-logout hyprland-logout"</span>
},
</pre>
</div>
</div>
</li>
<li><a id="org46e41c6"></a>custom/media<br />
<div class="outline-text-5" id="text-org46e41c6">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #bc8f8f;">"custom/media"</span>: {
  <span style="color: #bc8f8f;">"format"</span>: <span style="color: #bc8f8f;">"{icon} {}"</span>,
  <span style="color: #bc8f8f;">"return-type"</span>: <span style="color: #bc8f8f;">"json"</span>,
  <span style="color: #bc8f8f;">"max-length"</span>: 40,
  <span style="color: #bc8f8f;">"format-icons"</span>: {
    <span style="color: #bc8f8f;">"spotify"</span>: <span style="color: #bc8f8f;">"&#61884;"</span>,
    <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"&#127900;"</span>
  },
  <span style="color: #bc8f8f;">"escape"</span>: <span style="color: #5f9ea0;">true</span>,
  <span style="color: #bc8f8f;">"exec"</span>: <span style="color: #bc8f8f;">"$HOME/.config/waybar/mediaplayer.py 2&gt; /dev/null"</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">Script in resources folder</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">"exec": "$HOME/.config/waybar/mediaplayer.py --player spotify 2&gt; /dev/null" // Filter player based on name</span>
}
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org538bea3" class="outline-4">
<h4 id="org538bea3">End config</h4>
<div class="outline-text-4" id="text-org538bea3">
<div class="org-src-container">
<pre class="src src-js">}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org486b662" class="outline-3">
<h3 id="org486b662"><code>~/.config/waybar/style.css</code></h3>
<div class="outline-text-3" id="text-org486b662">
</div>
