index.html
<div id="outline-container-org6f5eae3" class="outline-4">
<h4 id="org6f5eae3">tooltip</h4>
<div class="outline-text-4" id="text-org6f5eae3">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">tooltip</span> {
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@background</span>;
    <span style="color: #4169e1;">border</span>: 1px solid <span style="color: #00008b;">@cyan</span>;
}

<span style="color: #0000ff;">tooltip label</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @white;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">label:focus</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@background</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3d1895" class="outline-4">
<h4 id="orgf3d1895">modules</h4>
<div class="outline-text-4" id="text-orgf3d1895">
</div>
<ul class="org-ul">
<li><a id="org29f9ddc"></a>cpu<br />
<div class="outline-text-5" id="text-org29f9ddc">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#cpu</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@cyan2</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgeefd255"></a>memory<br />
<div class="outline-text-5" id="text-orgeefd255">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#memory</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org69fb2a7"></a>keyboard-state<br />
<div class="outline-text-5" id="text-org69fb2a7">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#keyboard-state</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgb5c321e"></a>temperature<br />
<div class="outline-text-5" id="text-orgb5c321e">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#temperature</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org7db78ee"></a>modules-left<br />
<div class="outline-text-5" id="text-org7db78ee">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">.modules-left &gt; widget:first-child &gt; #workspaces</span> {
    <span style="color: #4169e1;">margin-left</span>: 0;
}
</pre>
</div>
</div>
</li>
<li><a id="org0bf6cbc"></a>modules-right<br />
<div class="outline-text-5" id="text-org0bf6cbc">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">.modules-right &gt; widget:last-child &gt; #workspaces</span> {
    <span style="color: #4169e1;">margin-right</span>: 0;
}
</pre>
</div>
</div>
</li>
<li><a id="org0f4b266"></a>mpris<br />
<div class="outline-text-5" id="text-org0f4b266">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#mpris</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">padding: 0 4px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">font-size: 9px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @warning;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org7aaf9fc"></a>idle_inhibitor<br />
<div class="outline-text-5" id="text-org7aaf9fc">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#idle_inhibitor</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@blue</span>;
}

<span style="color: #0000ff;">#idle_inhibitor.activated</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</li>
