index.html
<li><a id="orgcd4ac3c"></a>backlight<br />
<div class="outline-text-5" id="text-orgcd4ac3c">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#backlight</span>{
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @yellow;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@yellow</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org87f957d"></a>pulseaudio<br />
<div class="outline-text-5" id="text-org87f957d">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#pulseaudio</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @magenta2;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @wireplumber;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgd53aa77"></a>wireplumber<br />
<div class="outline-text-5" id="text-orgd53aa77">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#wireplumber</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @magenta2;</span><span style="color: #b22222;"> */</span>
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org065cdc3"></a>keyboard-state<br />
<div class="outline-text-5" id="text-org065cdc3">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#keyboard-state</span> {
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orgee3fd69"></a>battery<br />
<div class="outline-text-5" id="text-orgee3fd69">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#battery</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @battery;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @yellow2;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}

<span style="color: #0000ff;">#battery.charging, #battery.plugged</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @yellow;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @background;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@magenta</span>;
}

<span style="color: #b22222;">/* </span><span style="color: #b22222;">#battery.warning:not(.charging) {</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">/\* background: @red; *\/</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">/\* color: @white; *\/</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">animation-name: blink;</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">animation-duration: 0.5s;</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">animation-timing-function: steps(12);</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">animation-iteration-count: infinite;</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/*     </span><span style="color: #b22222;">animation-direction: alternate;</span><span style="color: #b22222;"> */</span>
<span style="color: #b22222;">/* </span><span style="color: #b22222;">}</span><span style="color: #b22222;"> */</span>

<span style="color: #0000ff;">#battery.critical:not(.charging)</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @red;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @white;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">animation-name: blink;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">animation-duration: 0.5s;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">animation-timing-function: linear;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">animation-iteration-count: infinite;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">animation-direction: alternate;</span><span style="color: #b22222;"> */</span>
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@magenta</span>;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">animation-name</span>: blink;
    <span style="color: #4169e1;">animation-duration</span>: 0.5s;
    <span style="color: #4169e1;">animation-timing-function</span>: linear;
    <span style="color: #4169e1;">animation-iteration-count</span>: infinite;
    <span style="color: #4169e1;">animation-direction</span>: alternate;
}
</pre>
</div>
</div>
</li>
<li><a id="org2938ebe"></a>custom/pacman<br />
<div class="outline-text-5" id="text-org2938ebe">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#custom-pacman</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @black;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @green2;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@yellow</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org4b17ab1"></a>clock<br />
<div class="outline-text-5" id="text-org4b17ab1">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#clock.date</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @date;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @magenta2;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
}

<span style="color: #0000ff;">#clock.time</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @time;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@yellow</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="orge84dd88"></a>network<br />
<div class="outline-text-5" id="text-orge84dd88">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#network</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @network;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@magenta</span>;
}

<span style="color: #0000ff;">#network.wifi</span> {
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@yellow</span>;
}

<span style="color: #0000ff;">#network.ethernet</span> {
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}

<span style="color: #0000ff;">#network.linked</span> {
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
}

<span style="color: #0000ff;">#network.disconnected</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@red</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</li>
