index.org
**** custom-launcher
#+begin_src css
  #custom-launcher {
  	font-size: 24px;
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 5px;
  	border-radius: 10px;
  	transition: none;
      color: @black;
      background: @blue;
  }
#+end_src
**** custom-power
#+begin_src css
  #custom-power {
    	font-size: 24px;
    	margin-top: 6px;
    	margin-left: 8px;
    	padding-left: 10px;
    	padding-right: 5px;
    	border-radius: 10px;
    	transition: none;
        color: @black;
        background: @blue;
  }
#+end_src
*** workspaces
#+begin_src css
  #workspaces {
  	margin-top: 6px;
      margin-left: 12px;
      font-size: 4px;
      margin-bottom: 0px;
      border-radius: 10px;
      background: @green;
      transition: none;
  }

  #workspaces button {
      /* color: @nord_light; */
      /* padding: 0 4px; */
      /* color: @workspacebutton; */
      /* font-size: 14px; */
      /* font-weight: bold; */
  	transition: none;
  	color: @black;
  	background: transparent;
  	font-size: 16px;
  	border-radius: 2px;
  }

  #workspaces button.occupied {
  	transition: none;
  	color: @blue;
  	background: transparent;
  	font-size: 4px;
  }

  #workspaces button.empty {
      color: @cyan;
  }

  #workspaces button.active {
      font-weight: bold;
      color: @white;
  }

  #workspaces button:hover {
  	transition: none;
  	/* box-shadow: inherit; */
  	/* text-shadow: inherit; */
  	color: @yellow;
      /* border-color: @red; */
  }

  #workspaces button.focused {
      /* background-color: @black; */
      /* color: @red; */
      /* border-top: 2px solid @red; */
  	color: @green;
      /* border-top: 2px solid @green; */
      /* border-bottom: 2px solid @green; */
  }

  #workspaces button.focused:hover {
      color: @red;
  }

  #workspaces button.urgent {
      background-color: @red;
  }
#+end_src
*** mode
#+begin_src css :tangle no
  #mode {
      color: @black;
  }
#+end_src
*** submap
#+begin_src css :tangle no
  #submap {
      color: @yellow;
  }
#+end_src
*** tray
#+begin_src css
  #tray {
  	margin-top: 6px;
  	margin-left: 8px;
  	padding-left: 10px;
  	padding-right: 10px;
  	margin-bottom: 0px;
  	border-radius: 10px;
  	transition: none;
  	color: @white;
  	background: @blue;
  }

  #tray > .passive {
      -gtk-icon-effect: dim;
  }

  #tray > .needs-attention {
      -gtk-icon-effect: highlight;
      background-color: @red;
  }
#+end_src
* hyprpaper
:PROPERTIES:
:header-args: :tangle .config/hypr/hyprpaper.conf :mkdirp t
:END:
#+begin_src conf
  preload = ~/.local/share/wallpapers/nord/Minimal-Nord.png
  preload = ~/.local/share/wallpapers/nord/linux-friends-4k.png
  preload = ~/.local/share/wallpapers/nord/nord_buildings.png
  preload = ~/.local/share/wallpapers/nord/keyboard.png
  preload = ~/.local/share/wallpapers/nord/nord_mountains.png
  preload = ~/.local/share/wallpapers/nord/wild.png
  preload = ~/.local/share/wallpapers/nord/nord_lake.png
  preload = ~/.local/share/wallpapers/nord/nord_space.png
  preload = ~/.local/share/wallpapers/nord/nord_alone_tree.png
  preload = ~/.local/share/wallpapers/nord/nord_valley.png
  splash = false

  # wallpaper = eDP1,~/.local/share/wallpapers/nord/ign-hevlettpackard.png
  #wallpaper = DP-1,~/.local/share/wallpapers/nord/ign-hevlettpackard.png
  #wallpaper = DP-2,~/.local/share/wallpapers/nord/ign-hevlettpackard.png
  #wallpaper = DP-3,~/.local/share/wallpapers/nord/ign-hevlettpackard.png
  #wallpaper = DP-4,~/.local/share/wallpapers/nord/ign-hevlettpackard.png
  #wallpaper = DP-5,~/.local/share/wallpapers/nord/ign-hevlettpackard.png
  #wallpaper = HDMI-A-1,~/.local/share/wallpapers/nord/ign_duaAnime.png
  wallpaper = ,~/.local/share/wallpapers/nord/Minimal-Nord.png
#+end_src
* hyprshade 
:PROPERTIES:
:header-args: :tangle .config/hypr/hyprshade.toml :mkdirp t
:END:

#+begin_src toml
  [[shades]]
  name = "vibrance"
  default = true  # shader to use during times when there is no other shader scheduled

  [[shades]]
  name = "blue-light-filter"
  start_time = 19:00:00
  end_time = 06:00:00   # optional if you have more than one shade with start_time
#+end_src
