index.html
<li><a id="orgc5cc0da"></a>custom-launcher<br />
<div class="outline-text-5" id="text-orgc5cc0da">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#custom-launcher</span> {
      <span style="color: #4169e1;">font-size</span>: 24px;
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 5px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
<li><a id="org9edd8d0"></a>custom-power<br />
<div class="outline-text-5" id="text-org9edd8d0">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#custom-power</span> {
      <span style="color: #4169e1;">font-size</span>: 24px;
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 5px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfdda4d4" class="outline-4">
<h4 id="orgfdda4d4">workspaces</h4>
<div class="outline-text-4" id="text-orgfdda4d4">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#workspaces</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
    <span style="color: #4169e1;">margin-left</span>: 12px;
    <span style="color: #4169e1;">font-size</span>: 4px;
    <span style="color: #4169e1;">margin-bottom</span>: 0px;
    <span style="color: #4169e1;">border-radius</span>: 10px;
    <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@green</span>;
    <span style="color: #4169e1;">transition</span>: none;
}

<span style="color: #0000ff;">#workspaces button</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @nord_light;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">padding: 0 4px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @workspacebutton;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">font-size: 14px;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">font-weight: bold;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
      <span style="color: #4169e1;">background</span>: transparent;
      <span style="color: #4169e1;">font-size</span>: 16px;
      <span style="color: #4169e1;">border-radius</span>: 2px;
}

<span style="color: #0000ff;">#workspaces button.occupied</span> {
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@blue</span>;
      <span style="color: #4169e1;">background</span>: transparent;
      <span style="color: #4169e1;">font-size</span>: 4px;
}

<span style="color: #0000ff;">#workspaces button.empty</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@cyan</span>;
}

<span style="color: #0000ff;">#workspaces button.active</span> {
    <span style="color: #4169e1;">font-weight</span>: bold;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@white</span>;
}

<span style="color: #0000ff;">#workspaces button:hover</span> {
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #b22222;">/* </span><span style="color: #b22222;">box-shadow: inherit;</span><span style="color: #b22222;"> */</span>
      <span style="color: #b22222;">/* </span><span style="color: #b22222;">text-shadow: inherit;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@yellow</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-color: @red;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">#workspaces button.focused</span> {
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">background-color: @black;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">color: @red;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-top: 2px solid @red;</span><span style="color: #b22222;"> */</span>
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@green</span>;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-top: 2px solid @green;</span><span style="color: #b22222;"> */</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border-bottom: 2px solid @green;</span><span style="color: #b22222;"> */</span>
}

<span style="color: #0000ff;">#workspaces button.focused:hover</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@red</span>;
}

<span style="color: #0000ff;">#workspaces button.urgent</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e9e89d" class="outline-4">
<h4 id="org7e9e89d">mode</h4>
<div class="outline-text-4" id="text-org7e9e89d">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#mode</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@black</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1d5f85b" class="outline-4">
<h4 id="org1d5f85b">submap</h4>
<div class="outline-text-4" id="text-org1d5f85b">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#submap</span> {
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@yellow</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org6fb1108" class="outline-4">
<h4 id="org6fb1108">tray</h4>
<div class="outline-text-4" id="text-org6fb1108">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">#tray</span> {
      <span style="color: #4169e1;">margin-top</span>: 6px;
      <span style="color: #4169e1;">margin-left</span>: 8px;
      <span style="color: #4169e1;">padding-left</span>: 10px;
      <span style="color: #4169e1;">padding-right</span>: 10px;
      <span style="color: #4169e1;">margin-bottom</span>: 0px;
      <span style="color: #4169e1;">border-radius</span>: 10px;
      <span style="color: #4169e1;">transition</span>: none;
      <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@white</span>;
      <span style="color: #4169e1;">background</span>: <span style="color: #00008b;">@blue</span>;
}

<span style="color: #0000ff;">#tray &gt; .passive</span> {
    -gtk-icon-effect: dim;
}

<span style="color: #0000ff;">#tray &gt; .needs-attention</span> {
    -gtk-icon-effect: highlight;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@red</span>;
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org823d539" class="outline-2">
<h2 id="org823d539">hyprpaper</h2>
<div class="outline-text-2" id="text-org823d539">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/Minimal-Nord.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/linux-friends-4k.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/nord_buildings.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/keyboard.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/nord_mountains.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/wild.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/nord_lake.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/nord_space.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/nord_alone_tree.png
<span style="color: #b8860b;">preload</span> = ~/.local/share/wallpapers/nord/nord_valley.png
<span style="color: #b8860b;">splash</span> = false

<span style="color: #b22222;"># </span><span style="color: #b22222;">wallpaper = eDP1,~/.local/share/wallpapers/nord/ign-hevlettpackard.png</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">wallpaper = DP-1,~/.local/share/wallpapers/nord/ign-hevlettpackard.png</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">wallpaper = DP-2,~/.local/share/wallpapers/nord/ign-hevlettpackard.png</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">wallpaper = DP-3,~/.local/share/wallpapers/nord/ign-hevlettpackard.png</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">wallpaper = DP-4,~/.local/share/wallpapers/nord/ign-hevlettpackard.png</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">wallpaper = DP-5,~/.local/share/wallpapers/nord/ign-hevlettpackard.png</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">wallpaper = HDMI-A-1,~/.local/share/wallpapers/nord/ign_duaAnime.png</span>
<span style="color: #b8860b;">wallpaper</span> = ,~/.local/share/wallpapers/nord/Minimal-Nord.png
</pre>
</div>
</div>
</div>
<div id="outline-container-org141947d" class="outline-2">
<h2 id="org141947d">hyprshade</h2>
<div class="outline-text-2" id="text-org141947d">
<div class="org-src-container">
<pre class="src src-toml">[[<span style="color: #228b22;">shades</span>]]
<span style="color: #b8860b;">name</span> = <span style="color: #bc8f8f;">"vibrance"</span>
<span style="color: #b8860b;">default</span> = <span style="color: #4169e1;">true</span>  <span style="color: #b22222;"># </span><span style="color: #b22222;">shader to use during times when there is no other shader scheduled</span>

[[<span style="color: #228b22;">shades</span>]]
<span style="color: #b8860b;">name</span> = <span style="color: #bc8f8f;">"blue-light-filter"</span>
<span style="color: #b8860b;">start_time</span> = 19:00:00
<span style="color: #b8860b;">end_time</span> = 06:00:00   <span style="color: #b22222;"># </span><span style="color: #b22222;">optional if you have more than one shade with start_time</span>
</pre>
</div>
</div>
</div>
