index.org
* hyprlock
:PROPERTIES:
:header-args: :tangle .config/hypr/hyprlock.conf :mkdirp t
:END:

#+begin_src conf
  # -*- eval: (rainbow-mode 1) -*-

  $text_color = rgba(D8DEE9FF)
  $entry_background_color = rgba(2E344011)
  $entry_border_color = rgba(3B3B3B55)
  $entry_color = rgba(FFFFFFFF)
  $font_family = Rubik Light
  $font_family_clock = Rubik Light
  $font_material_symbols = Material Symbols Rounded

  background {
    monitor =
    #path = /home/mkncorp.com/kristian.alexander/.local/share/wallpapers/nord/linux-friends-4k.png   # only png supported for now
    path = screenshot
    color = rgba(000000FF)
    # all these options are taken from hyprland, see https://wiki.hyprland.org/Configuring/Variables/#blur for explanations
    blur_passes = 1 # 0 disables blurring
    blur_size = 3
    noise = 0.0117
    contrast = 0.8916
    brightness = 0.8172
    vibrancy = 0.1696
    vibrancy_darkness = 0.0
  }

  label { # Greeting
    monitor =
    text = <span foreground='##D8DEE9'>Hi there,</span><span foreground='##8FBCBB'> <i>$DESC</i></span>
    color = rgba(BF616AFF)
    check_color = rgba(EBCB8BFF)
    fail_color = rgba(BF616AFF) # if authentication failed, changes outer_color and fail message color
    fail_text = <span foreground='##D8DEE9'><i>$FAIL <b>($ATTEMPTS)</b></i></span> # can be set to empty
    fail_timeout = 2000 # milliseconds before fail_text and fail_color disappears
    fail_transition = 300 # transition time in ms between normal outer_color and fail_color
    shadow_passes = 1
    shadow_boost = 0.5
    color = $text_color
    font_size = 20
    font_family = $font_family

    position = 0, 240
    halign = center
    valign = center
  }

  label { # lock icon
    monitor =
    text = lock
    shadow_passes = 1
    shadow_boost = 0.5
    color = $text_color
    font_size = 21
    font_family = $font_material_symbols

    position = 0, 65
    halign = center
    valign = bottom
  }

  label { # Clock
    monitor =
    text = $TIME
    shadow_passes = 1
    shadow_boost = 0.5
    color = $text_color
    font_size = 65
    font_family = $font_family_clock

    position = 0, 300
    halign = center
    valign = center
  }

  input-field {
    monitor =
    size = 250, 50
    outline_thickness = 2
    dots_size = 0.1
    dots_spacing = 0.3
    outer_color = $entry_border_color
    inner_color = $entry_background_color
    font_color = $entry_color
    # fade_on_empty = true

    position = 0, 20
    halign = center
    valign = center
  }
#+end_src
* hypridle
:PROPERTIES:
:header-args: :tangle .config/hypr/hypridle.conf :mkdirp t
:END:

#+begin_src conf-unix
  general {
    lock_cmd = pidof hyprlock || hyprlock       # avoid starting multiple hyprlock instances.
    before_sleep_cmd = loginctl lock-session    # lock before suspend.
    # after_sleep_cmd = hyprctl dispatch dpms on  # to avoid having to press a key twice to turn on the display.
  }

  listener {
    timeout = 180
    on-timeout = loginctl lock-session            # lock screen when timeout has passed
  }

  listener {
    timeout = 240
    on-timeout = hyprctl dispatch dpms off
    on-resume = hyprctl dispatch dpms on
  }

  listener {
    timeout = 540
    on-timeout = pidof steam || systemctl suspend || loginctl suspend
  }
#+end_src
* Alacritty
