index.html
<div id="outline-container-orgd149543" class="outline-2">
<h2 id="orgd149543">hyprlock</h2>
<div class="outline-text-2" id="text-orgd149543">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">-*- eval: (rainbow-mode 1) -*-</span>

<span style="color: #b8860b;">$text_color</span> = rgba(D8DEE9FF)
<span style="color: #b8860b;">$entry_background_color</span> = rgba(2E344011)
<span style="color: #b8860b;">$entry_border_color</span> = rgba(3B3B3B55)
<span style="color: #b8860b;">$entry_color</span> = rgba(FFFFFFFF)
<span style="color: #b8860b;">$font_family</span> = Rubik Light
<span style="color: #b8860b;">$font_family_clock</span> = Rubik Light
<span style="color: #b8860b;">$font_material_symbols</span> = Material Symbols Rounded

<span style="color: #228b22;">background</span> {
  <span style="color: #b8860b;">monitor</span> =
  <span style="color: #b22222;">#</span><span style="color: #b22222;">path = /home/mkncorp.com/kristian.alexander/.local/share/wallpapers/nord/linux-friends-4k.png   # only png supported for now</span>
  <span style="color: #b8860b;">path</span> = screenshot
  <span style="color: #b8860b;">color</span> = rgba(000000FF)
  <span style="color: #b22222;"># </span><span style="color: #b22222;">all these options are taken from hyprland, see https://wiki.hyprland.org/Configuring/Variables/#blur for explanations</span>
  <span style="color: #b8860b;">blur_passes</span> = 1 <span style="color: #b22222;"># </span><span style="color: #b22222;">0 disables blurring</span>
  <span style="color: #b8860b;">blur_size</span> = 3
  <span style="color: #b8860b;">noise</span> = 0.0117
  <span style="color: #b8860b;">contrast</span> = 0.8916
  <span style="color: #b8860b;">brightness</span> = 0.8172
  <span style="color: #b8860b;">vibrancy</span> = 0.1696
  <span style="color: #b8860b;">vibrancy_darkness</span> = 0.0
}

<span style="color: #228b22;">label</span> { <span style="color: #b22222;"># </span><span style="color: #b22222;">Greeting</span>
  <span style="color: #b8860b;">monitor</span> =
  <span style="color: #b8860b;">text</span> = &lt;span foreground=<span style="color: #bc8f8f;">'##D8DEE9'</span>&gt;Hi there,&lt;/span&gt;&lt;span foreground=<span style="color: #bc8f8f;">'##8FBCBB'</span>&gt; &lt;i&gt;$DESC&lt;/i&gt;&lt;/span&gt;
  <span style="color: #b8860b;">color</span> = rgba(BF616AFF)
  <span style="color: #b8860b;">check_color</span> = rgba(EBCB8BFF)
  <span style="color: #b8860b;">fail_color</span> = rgba(BF616AFF) <span style="color: #b22222;"># </span><span style="color: #b22222;">if authentication failed, changes outer_color and fail message color</span>
  <span style="color: #b8860b;">fail_text</span> = &lt;span foreground=<span style="color: #bc8f8f;">'##D8DEE9'</span>&gt;&lt;i&gt;$FAIL &lt;b&gt;($ATTEMPTS)&lt;/b&gt;&lt;/i&gt;&lt;/span&gt; <span style="color: #b22222;"># </span><span style="color: #b22222;">can be set to empty</span>
  <span style="color: #b8860b;">fail_timeout</span> = 2000 <span style="color: #b22222;"># </span><span style="color: #b22222;">milliseconds before fail_text and fail_color disappears</span>
  <span style="color: #b8860b;">fail_transition</span> = 300 <span style="color: #b22222;"># </span><span style="color: #b22222;">transition time in ms between normal outer_color and fail_color</span>
  <span style="color: #b8860b;">shadow_passes</span> = 1
  <span style="color: #b8860b;">shadow_boost</span> = 0.5
  <span style="color: #b8860b;">color</span> = $text_color
  <span style="color: #b8860b;">font_size</span> = 20
  <span style="color: #b8860b;">font_family</span> = $font_family

  <span style="color: #b8860b;">position</span> = 0, 240
  <span style="color: #b8860b;">halign</span> = center
  <span style="color: #b8860b;">valign</span> = center
}

<span style="color: #228b22;">label</span> { <span style="color: #b22222;"># </span><span style="color: #b22222;">lock icon</span>
  <span style="color: #b8860b;">monitor</span> =
  <span style="color: #b8860b;">text</span> = lock
  <span style="color: #b8860b;">shadow_passes</span> = 1
  <span style="color: #b8860b;">shadow_boost</span> = 0.5
  <span style="color: #b8860b;">color</span> = $text_color
  <span style="color: #b8860b;">font_size</span> = 21
  <span style="color: #b8860b;">font_family</span> = $font_material_symbols

  <span style="color: #b8860b;">position</span> = 0, 65
  <span style="color: #b8860b;">halign</span> = center
  <span style="color: #b8860b;">valign</span> = bottom
}

<span style="color: #228b22;">label</span> { <span style="color: #b22222;"># </span><span style="color: #b22222;">Clock</span>
  <span style="color: #b8860b;">monitor</span> =
  <span style="color: #b8860b;">text</span> = $TIME
  <span style="color: #b8860b;">shadow_passes</span> = 1
  <span style="color: #b8860b;">shadow_boost</span> = 0.5
  <span style="color: #b8860b;">color</span> = $text_color
  <span style="color: #b8860b;">font_size</span> = 65
  <span style="color: #b8860b;">font_family</span> = $font_family_clock

  <span style="color: #b8860b;">position</span> = 0, 300
  <span style="color: #b8860b;">halign</span> = center
  <span style="color: #b8860b;">valign</span> = center
}

<span style="color: #228b22;">input-field</span> {
  <span style="color: #b8860b;">monitor</span> =
  <span style="color: #b8860b;">size</span> = 250, 50
  <span style="color: #b8860b;">outline_thickness</span> = 2
  <span style="color: #b8860b;">dots_size</span> = 0.1
  <span style="color: #b8860b;">dots_spacing</span> = 0.3
  <span style="color: #b8860b;">outer_color</span> = $entry_border_color
  <span style="color: #b8860b;">inner_color</span> = $entry_background_color
  <span style="color: #b8860b;">font_color</span> = $entry_color
  <span style="color: #b22222;"># </span><span style="color: #b22222;">fade_on_empty = true</span>

  <span style="color: #b8860b;">position</span> = 0, 20
  <span style="color: #b8860b;">halign</span> = center
  <span style="color: #b8860b;">valign</span> = center
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4282b1" class="outline-2">
<h2 id="orge4282b1">hypridle</h2>
<div class="outline-text-2" id="text-orge4282b1">
<div class="org-src-container">
<pre class="src src-conf-unix"><span style="color: #228b22;">general</span> {
  <span style="color: #b8860b;">lock_cmd</span> = pidof hyprlock || hyprlock       <span style="color: #b22222;"># </span><span style="color: #b22222;">avoid starting multiple hyprlock instances.</span>
  <span style="color: #b8860b;">before_sleep_cmd</span> = loginctl lock-session    <span style="color: #b22222;"># </span><span style="color: #b22222;">lock before suspend.</span>
  <span style="color: #b22222;"># </span><span style="color: #b22222;">after_sleep_cmd = hyprctl dispatch dpms on  # to avoid having to press a key twice to turn on the display.</span>
}

<span style="color: #228b22;">listener</span> {
  <span style="color: #b8860b;">timeout</span> = 180
  <span style="color: #b8860b;">on-timeout</span> = loginctl lock-session            <span style="color: #b22222;"># </span><span style="color: #b22222;">lock screen when timeout has passed</span>
}

<span style="color: #228b22;">listener</span> {
  <span style="color: #b8860b;">timeout</span> = 240
  <span style="color: #b8860b;">on-timeout</span> = hyprctl dispatch dpms off
  <span style="color: #b8860b;">on-resume</span> = hyprctl dispatch dpms on
}

<span style="color: #228b22;">listener</span> {
  <span style="color: #b8860b;">timeout</span> = 540
  <span style="color: #b8860b;">on-timeout</span> = pidof steam || systemctl suspend || loginctl suspend
}
</pre>
</div>
</div>
</div>
