index.org
** ~/.config/alacritty/alacritty.toml
:PROPERTIES:
:header-args: :tangle .config/alacritty/alacritty.toml :mkdirp t
:END:
#+begin_src toml
  [general]
  import = ["~/.config/alacritty/themes/nord.toml"]
  live_config_reload = true
  [window]
  dynamic_padding = true
  decorations = "None"
  padding = { x = 25, y = 25 }
  blur = true
  #startup_mode = "Fullscreen"
  decorations_theme_variant = "Dark"
  [scrolling]
  history = 100000
  multiplier = 2
  [font]
  normal = { family = "JetBrainsMonoNL Nerd Font Mono", style = "Regular" }
  bold = { family = "JetBrainsMonoNL Nerd Font Mono", style = "Bold" }
  italic = { family = "JetBrainsMonoNL Nerd Font Mono", style = "Italic" }
  bold_italic = { family = "JetBrainsMonoNL Nerd Font Mono", style = "Semibold Italic" }
  size = 8
  [bell]
  animation = "EaseOutCirc"
  duration = 1
  # command = { program = "canberra-gtk-play", args = ["-i", "bell"] }
  [cursor]
  style = { shape = "Beam", blinking = "On" }
  vi_mode_style = { shape = "Block", blinking = "Off" }
  [mouse]
  hide_when_typing = true
  [selection]
  save_to_clipboard = true
  # [shell]
  # program = "/bin/bash"
  # args = ["-l"]
  [env]
  TERM = "xterm-256color"
  [[hints.enabled]]
  command = "xdg-open"
  hyperlinks = true
  post_processing = true
  persist = false
  mouse.enabled = true
  binding = { key = "U", mods = "Control|Shift" }
   regex = "(ipfs:|ipns:|magnet:|mailto:|gemini://|gopher://|https://|http://|news:|file:|git://|ssh:|ftp://)[^\u0000-\u001F\u007F-\u009F<>\"\\s{-}\\^⟨⟩`]+"
#+end_src
** nord theme
:PROPERTIES:
:header-args: :tangle .config/alacritty/themes/nord.toml :mkdirp t
:END:

#+begin_src toml
  # -*- eval: (rainbow-mode 1) -*-
  # Colors (Nord)

  # Default colors
  [colors.primary]
  background = '#2E3440'
  foreground = '#D8DEE9'

  # Normal colors
  [colors.normal]
  black   = '#3B4252'
  red     = '#BF616A'
  green   = '#A3BE8C'
  yellow  = '#EBCB8B'
  blue    = '#81A1C1'
  magenta = '#B48EAD'
  cyan    = '#88C0D0'
  white   = '#E5E9F0'

  # Bright colors
  [colors.bright]
  black   = '#4C566A'
  red     = '#BF616A'
  green   = '#A3BE8C'
  yellow  = '#EBCB8B'
  blue    = '#81A1C1'
  magenta = '#B48EAD'
  cyan    = '#8FBCBB'
  white   = '#ECEFF4'
#+end_src
* Swappy
:PROPERTIES:
:header-args: :tangle .config/swappy/config :mkdirp t
:END:
Wayland native snapshot editing tools.
#+begin_src conf -n
  [Default]
  save_dir=$HOME/Pictures/Screenshots
  save_filename_format=swappy-%Y%m%d-%H%M%S.png
  show_panel=false
  line_size=5
  text_size=20
  text_font=sans-serif
  paint_mode=brush
  early_exit=false
  fill_shape=false
#+end_src

* Rofi configuration
