index.html
<div id="outline-container-orgb33c183" class="outline-2">
<h2 id="orgb33c183">Alacritty</h2>
<div class="outline-text-2" id="text-orgb33c183">
</div>
<div id="outline-container-orgdc0e19f" class="outline-3">
<h3 id="orgdc0e19f">~/.config/alacritty/alacritty.toml</h3>
<div class="outline-text-3" id="text-orgdc0e19f">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">general</span>]
<span style="color: #b8860b;">import</span> = [<span style="color: #bc8f8f;">"~/.config/alacritty/themes/nord.toml"</span>]
<span style="color: #b8860b;">live_config_reload</span> = <span style="color: #4169e1;">true</span>
[<span style="color: #228b22;">window</span>]
<span style="color: #b8860b;">dynamic_padding</span> = <span style="color: #4169e1;">true</span>
<span style="color: #b8860b;">decorations</span> = <span style="color: #bc8f8f;">"None"</span>
<span style="color: #b8860b;">padding</span> = { x = 25, y = 25 }
<span style="color: #b8860b;">blur</span> = <span style="color: #4169e1;">true</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">startup_mode = "Fullscreen"</span>
<span style="color: #b8860b;">decorations_theme_variant</span> = <span style="color: #bc8f8f;">"Dark"</span>
[<span style="color: #228b22;">scrolling</span>]
<span style="color: #b8860b;">history</span> = 100000
<span style="color: #b8860b;">multiplier</span> = 2
[<span style="color: #228b22;">font</span>]
<span style="color: #b8860b;">normal</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Regular"</span> }
<span style="color: #b8860b;">bold</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Bold"</span> }
<span style="color: #b8860b;">italic</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Italic"</span> }
<span style="color: #b8860b;">bold_italic</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Semibold Italic"</span> }
<span style="color: #b8860b;">size</span> = 8
[<span style="color: #228b22;">bell</span>]
<span style="color: #b8860b;">animation</span> = <span style="color: #bc8f8f;">"EaseOutCirc"</span>
<span style="color: #b8860b;">duration</span> = 1
<span style="color: #b22222;"># </span><span style="color: #b22222;">command = { program = "canberra-gtk-play", args = ["-i", "bell"] }</span>
[<span style="color: #228b22;">cursor</span>]
<span style="color: #b8860b;">style</span> = { shape = <span style="color: #bc8f8f;">"Beam"</span>, blinking = <span style="color: #bc8f8f;">"On"</span> }
<span style="color: #b8860b;">vi_mode_style</span> = { shape = <span style="color: #bc8f8f;">"Block"</span>, blinking = <span style="color: #bc8f8f;">"Off"</span> }
[<span style="color: #228b22;">mouse</span>]
<span style="color: #b8860b;">hide_when_typing</span> = <span style="color: #4169e1;">true</span>
[<span style="color: #228b22;">selection</span>]
<span style="color: #b8860b;">save_to_clipboard</span> = <span style="color: #4169e1;">true</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">[shell]</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">program = "/bin/bash"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">args = ["-l"]</span>
[<span style="color: #228b22;">env</span>]
<span style="color: #b8860b;">TERM</span> = <span style="color: #bc8f8f;">"xterm-256color"</span>
[[<span style="color: #228b22;">hints.enabled</span>]]
<span style="color: #b8860b;">command</span> = <span style="color: #bc8f8f;">"xdg-open"</span>
<span style="color: #b8860b;">hyperlinks</span> = <span style="color: #4169e1;">true</span>
<span style="color: #b8860b;">post_processing</span> = <span style="color: #4169e1;">true</span>
<span style="color: #b8860b;">persist</span> = <span style="color: #4169e1;">false</span>
<span style="color: #b8860b;">mouse.enabled</span> = <span style="color: #4169e1;">true</span>
<span style="color: #b8860b;">binding</span> = { key = <span style="color: #bc8f8f;">"U"</span>, mods = <span style="color: #bc8f8f;">"Control|Shift"</span> }
 <span style="color: #b8860b;">regex</span> = <span style="color: #bc8f8f;">"(ipfs:|ipns:|magnet:|mailto:|gemini://|gopher://|https://|http://|news:|file:|git://|ssh:|ftp://)[^\u0000-\u001F\u007F-\u009F&lt;&gt;\"\\s{-}\\^&#10216;&#10217;`]+"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2fdd863" class="outline-3">
<h3 id="org2fdd863">nord theme</h3>
<div class="outline-text-3" id="text-org2fdd863">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b22222;"># </span><span style="color: #b22222;">-*- eval: (rainbow-mode 1) -*-</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Colors (Nord)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Default colors</span>
[<span style="color: #228b22;">colors.primary</span>]
<span style="color: #b8860b;">background</span> = <span style="color: #bc8f8f;">'#2E3440'</span>
<span style="color: #b8860b;">foreground</span> = <span style="color: #bc8f8f;">'#D8DEE9'</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Normal colors</span>
[<span style="color: #228b22;">colors.normal</span>]
<span style="color: #b8860b;">black</span>   = <span style="color: #bc8f8f;">'#3B4252'</span>
<span style="color: #b8860b;">red</span>     = <span style="color: #bc8f8f;">'#BF616A'</span>
<span style="color: #b8860b;">green</span>   = <span style="color: #bc8f8f;">'#A3BE8C'</span>
<span style="color: #b8860b;">yellow</span>  = <span style="color: #bc8f8f;">'#EBCB8B'</span>
<span style="color: #b8860b;">blue</span>    = <span style="color: #bc8f8f;">'#81A1C1'</span>
<span style="color: #b8860b;">magenta</span> = <span style="color: #bc8f8f;">'#B48EAD'</span>
<span style="color: #b8860b;">cyan</span>    = <span style="color: #bc8f8f;">'#88C0D0'</span>
<span style="color: #b8860b;">white</span>   = <span style="color: #bc8f8f;">'#E5E9F0'</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Bright colors</span>
[<span style="color: #228b22;">colors.bright</span>]
<span style="color: #b8860b;">black</span>   = <span style="color: #bc8f8f;">'#4C566A'</span>
<span style="color: #b8860b;">red</span>     = <span style="color: #bc8f8f;">'#BF616A'</span>
<span style="color: #b8860b;">green</span>   = <span style="color: #bc8f8f;">'#A3BE8C'</span>
<span style="color: #b8860b;">yellow</span>  = <span style="color: #bc8f8f;">'#EBCB8B'</span>
<span style="color: #b8860b;">blue</span>    = <span style="color: #bc8f8f;">'#81A1C1'</span>
<span style="color: #b8860b;">magenta</span> = <span style="color: #bc8f8f;">'#B48EAD'</span>
<span style="color: #b8860b;">cyan</span>    = <span style="color: #bc8f8f;">'#8FBCBB'</span>
<span style="color: #b8860b;">white</span>   = <span style="color: #bc8f8f;">'#ECEFF4'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga261c73" class="outline-2">
<h2 id="orga261c73">Swappy</h2>
<div class="outline-text-2" id="text-orga261c73">
<p>
Wayland native snapshot editing tools.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr"> 1: </span>[<span style="color: #228b22;">Default</span>]
<span class="linenr"> 2: </span><span style="color: #b8860b;">save_dir</span>=$HOME/Pictures/Screenshots
<span class="linenr"> 3: </span><span style="color: #b8860b;">save_filename_format</span>=swappy-%Y%m%d-%H%M%S.png
<span class="linenr"> 4: </span><span style="color: #b8860b;">show_panel</span>=false
<span class="linenr"> 5: </span><span style="color: #b8860b;">line_size</span>=5
<span class="linenr"> 6: </span><span style="color: #b8860b;">text_size</span>=20
<span class="linenr"> 7: </span><span style="color: #b8860b;">text_font</span>=sans-serif
<span class="linenr"> 8: </span><span style="color: #b8860b;">paint_mode</span>=brush
<span class="linenr"> 9: </span><span style="color: #b8860b;">early_exit</span>=false
<span class="linenr">10: </span><span style="color: #b8860b;">fill_shape</span>=false
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cc6b46" class="outline-2">
<h2 id="org2cc6b46">Rofi configuration</h2>
<div class="outline-text-2" id="text-org2cc6b46">
</div>
